{
  "types": {
    "ANXIOUS": {
      "reflection": "You [tone:frequency] notice changes in people's attention or tone, and when someone feels distant, your heart speeds up a little. There's a part of you that reaches for reassurance—wanting to know you're still important, still wanted.\n\nWhen conflict arises, you [tone:likelihood] move toward connection rather than away, hoping to repair and reconnect quickly. You notice small shifts that others might miss: a shorter text, a distracted look, a change in someone's usual warmth. These moments can feel bigger than they are because your system is finely tuned to detect threats to closeness.\n\nYour heart wants security, and when you feel uncertain about where you stand, you [tone:frequency] seek confirmation through words, time, or attention. This isn't neediness—it's a deep capacity for connection and a fear of losing what matters to you.",
      "secondaryBridge": {
        "AVOIDANT": "At the same time, another part of you values independence and pulls toward space when things feel too intense. This creates a real internal conflict—you might reach for reassurance, then feel uncomfortable with how much you're reaching and pull back. You can want closeness desperately in one moment, then feel suffocated by that same closeness and need to retreat. This contradiction can be exhausting because you're fighting yourself as much as navigating the relationship.",
        "DISORGANIZED": "Alongside this, you sometimes swing between seeking closeness and pulling back in ways that feel unpredictable even to you. You might pursue connection with urgency, then suddenly feel overwhelmed by the very intimacy you were craving. There are moments when you're not sure whether to move closer or create distance—both feel necessary and impossible at the same time. This contradiction can make relationships feel chaotic, not because you're being difficult, but because different parts of you have conflicting needs.",
        "SECURE": "Still, you also carry moments of calm and trust that help balance your need for reassurance. There are times when you can sit with uncertainty without spiraling, when you trust that someone's distance doesn't mean abandonment. These calmer moments remind you that not every shift in connection is a threat. When you're in this more grounded place, you can ask for what you need without the urgency that sometimes pushes people away."
      },
      "behavioralProfiles": {
        "STRONG": "Frequently needs reassurance and fears abandonment in relationships. Highly sensitive to partner's emotional availability and responsiveness. May engage in protest behaviors when feeling disconnected. Tends to interpret neutral behaviors as signs of rejection. Requires consistent emotional validation and clear communication about relationship security.",
        "MODERATE": "Sometimes seeks extra reassurance during stress or uncertainty. Generally trusts relationships but can become worried during periods of distance or conflict. May occasionally misinterpret partner behaviors as threatening. Benefits from regular check-ins and verbal affirmation of connection.",
        "MILD": "Occasionally needs reassurance during major relationship transitions or conflicts. Usually secure but can experience moments of doubt about partner's commitment. Generally manages uncertainty well with minimal support.",
        "VERY_MILD": "Rarely experiences significant relationship anxiety. Minimal need for extra reassurance beyond normal relationship maintenance."
      }
    },
    "AVOIDANT": {
      "reflection": "When emotions run high or someone wants to get closer, you [tone:frequency] feel a pull to step back and create some breathing room. There's something in you that values independence and self-reliance, especially when relationships start to feel intense or demanding.\n\nYou [tone:likelihood] handle conflict by taking space to think rather than diving straight into emotional conversations. This isn't because you don't care—it's because you process things differently. When someone needs too much from you, there's a quiet instinct to protect your sense of self by creating distance.\n\nYou might notice that you're more comfortable being the listener than the sharer, or that you prefer to handle your feelings on your own before bringing someone else in. This pattern likely has roots worth understanding.",
      "secondaryBridge": {
        "ANXIOUS": "Yet underneath that need for space, there's another part of you that worries about losing connection. You might create distance to breathe, then panic that you've pushed someone away. There's a moment after you've withdrawn when you wonder if you've gone too far, if they'll still be there when you're ready to return. This creates an internal conflict—you need autonomy to feel safe, but you also need reassurance that your autonomy won't cost you the relationship.",
        "DISORGANIZED": "Sometimes you also find yourself swinging between needing distance and suddenly craving closeness in ways that feel confusing even to you. You might feel perfectly comfortable alone, then suddenly feel desperate for connection. Or you'll reach for intimacy, then immediately want to retreat before the other person can get too close. This unpredictability can make it hard to know what you actually want—both solitude and connection feel necessary and threatening at the same time.",
        "SECURE": "At times, though, you feel steady and trusting in ways that make closeness easier. There are moments when you can be emotionally present without feeling trapped, when you can share feelings without fear of being overwhelmed. These secure moments show you that intimacy doesn't have to mean losing yourself. When you're in this more grounded place, you can stay connected even when things get difficult, instead of automatically reaching for distance."
      },
      "behavioralProfiles": {
        "STRONG": "Maintains strong preference for independence and emotional distance in relationships. May withdraw or shut down during conflict or high emotion. Values self-sufficiency highly and may feel uncomfortable with intense emotional expression or dependency. Can appear dismissive of partners' emotional needs.",
        "MODERATE": "Generally comfortable with independence but can engage in closeness when not feeling pressured. May need space during conflict but can reconnect after processing alone. Values autonomy but maintains relationships with understanding partners.",
        "MILD": "Mild preference for independence with capacity for emotional intimacy. Occasionally needs space during stress but usually engages in relationship maintenance. Generally comfortable with both closeness and autonomy.",
        "VERY_MILD": "Minimal avoidant patterns. Mostly comfortable with emotional closeness and interdependence."
      }
    },
    "DISORGANIZED": {
      "reflection": "Closeness can feel both deeply wanted and somehow unsafe at the same time. You [tone:frequency] find yourself swinging between reaching for connection and pulling away from it, sometimes without fully understanding why. One moment you might crave closeness, and the next, that same closeness feels overwhelming or threatening.\n\nIn relationships, you [tone:likelihood] experience conflicting feelings about intimacy—part of you wants to be seen and held, while another part fears what might happen if you let someone in too far. This contradiction can be confusing not just for others, but for you too.\n\nYour patterns around trust and connection may feel more chaotic or contradictory than you'd like. This often traces back to early experiences where safety and closeness were unpredictable.",
      "secondaryBridge": {
        "ANXIOUS": "On top of this contradiction, you also carry a deep fear of abandonment that intensifies everything. When you're pulling away, you're simultaneously terrified that the person will leave. When you're reaching for closeness, you're afraid you'll be too much and drive them away. This combination creates intense anxiety—you can't settle into either distance or closeness because both feel dangerous. The fear of loss makes it even harder to trust your own conflicting impulses.",
        "AVOIDANT": "Additionally, you sometimes cope by withdrawing when things feel too vulnerable, which makes the pattern even more complex. You might swing toward someone with real intensity, then suddenly shut down completely when they respond. Part of you wants to protect yourself through distance, but another part feels abandoned by your own withdrawal. This creates a painful cycle where neither moving closer nor pulling back brings relief—both feel like losing something important.",
        "SECURE": "Still, you have moments of steadiness that help you find your way back to balance, even after the confusion. There are times when you can pause and recognize the conflict without being consumed by it. These more grounded moments remind you that the chaos isn't permanent—you can experience conflicting feelings without acting on all of them immediately. When you access this secure place, you can sit with the confusion long enough to choose how you want to respond, rather than just reacting."
      },
      "behavioralProfiles": {
        "STRONG": "Experiences intense internal conflict about intimacy with unpredictable relationship behavior. May simultaneously seek and sabotage closeness. Can have dramatic emotional swings in relationships. Often traces to early experiences of inconsistent caregiving or trauma. Requires patient partners and likely benefits from professional support.",
        "MODERATE": "Noticeable push-pull patterns in relationships with periods of both seeking and avoiding intimacy. Can maintain relationships but experiences confusion about own needs and feelings. Benefits from partners who understand complexity.",
        "MILD": "Occasional conflicted feelings about closeness, usually manageable. Can form stable relationships with some moments of confusion about intimacy needs.",
        "VERY_MILD": "Minimal disorganized patterns. Occasional moments of ambivalence about closeness but generally stable in relationships."
      }
    },
    "SECURE": {
      "reflection": "You [tone:frequency] approach relationships with a steady trust that things will work out, even when there are bumps along the way. When conflict arises, you [tone:likelihood] stay relatively calm and can communicate your feelings without losing your center.\n\nYou're comfortable with both closeness and independence—you can be deeply connected to someone while still maintaining your own sense of self. You don't panic when someone needs space, and you don't feel threatened when they want more closeness.\n\nYour emotional responses tend to match the actual situation rather than being amplified by old fears or wounds. You can express your needs clearly and listen to others without getting defensive, and your instinct for independence and connection likely has roots worth understanding.",
      "secondaryBridge": {
        "ANXIOUS": "At times, though, you also notice worries about closeness that don't fully disappear, especially during stress. There are moments when you need more reassurance than usual, when someone's tone or distance triggers old fears even though you generally feel secure. These anxious moments don't mean your security is fragile—they're just reminders that we all have vulnerable places. You've learned to recognize when you're in this space and can usually find your way back to trust, but the worry still surfaces when things feel uncertain.",
        "AVOIDANT": "There are also moments when distance feels easier than closeness, even if connection usually wins out. Sometimes intimacy can feel like too much, and you need to step back to remember yourself. You might notice this especially during conflict or when someone's emotions run high—there's a pull to retreat that you usually resist but still feel. These avoidant impulses don't dominate your relationships, but they're there in the background, occasionally nudging you toward space when staying emotionally present feels demanding.",
        "DISORGANIZED": "Sometimes you still swing between pulling close and pulling away, though you recover from the confusion more quickly than you used to. There are moments when you're not sure whether to lean in or create distance—when both feel right and wrong at the same time. These confusing moments can be unsettling because they contradict your usual steadiness. The difference is that you've built enough security to manage the contradiction without it destabilizing everything. You can feel the conflict and still choose your response."
      },
      "behavioralProfiles": {
        "STRONG": "Comfortable with both intimacy and independence in relationships. Maintains trust and emotional stability even during conflict or stress. Communicates needs and feelings directly and listens well to others. Can provide emotional support without losing sense of self. Generally optimistic about relationships and believes in working through problems together.",
        "MODERATE": "Usually secure and trusting in relationships with occasional moments of doubt during major stress. Good communication skills and emotional regulation most of the time. Can maintain connection while respecting both partners' needs for autonomy.",
        "MILD": "Generally secure foundation with minor insecurities that surface during relationship challenges. Usually handles conflict and intimacy well but may need support during particularly difficult periods.",
        "VERY_MILD": "Minimal secure patterns alongside other more dominant attachment styles."
      }
    }
  },
  "toneModifiers": {
    "VERY_MILD": {
      "frequency": "occasionally",
      "likelihood": "at times"
    },
    "MILD": {
      "frequency": "sometimes",
      "likelihood": "can"
    },
    "MODERATE": {
      "frequency": "often",
      "likelihood": "tend to"
    },
    "STRONG": {
      "frequency": "regularly",
      "likelihood": "usually"
    }
  },
  "combinationProfiles": {
    "ANXIOUS_STRONG_AVOIDANT_MODERATE": "Experiences significant internal conflict between needing reassurance and wanting independence. May pursue connection then withdraw when it becomes available. Relationships feel both essential and threatening. Requires very patient partners who can provide consistent security while respecting need for autonomy.",
    "ANXIOUS_STRONG_AVOIDANT_STRONG": "Intense push-pull between desperate need for connection and strong drive for independence. May create chaotic relationship patterns of pursuit and withdrawal. Extremely difficult internal conflict that requires professional support and very understanding partners.",
    "ANXIOUS_STRONG_SECURE_MODERATE": "Generally trusting and communicative but with notable need for reassurance during stress. Can maintain stable relationships while occasionally needing extra validation. Strong foundation with manageable anxiety patterns.",
    "ANXIOUS_STRONG_DISORGANIZED_MODERATE": "Intense fear of abandonment combined with conflicted feelings about intimacy. May have extreme emotional reactions and difficulty regulating during relationship stress. Needs highly stable, patient partners and likely professional support.",
    "AVOIDANT_STRONG_ANXIOUS_MODERATE": "Primarily values independence but has underlying need for connection that creates internal tension. May appear distant while secretly wanting closeness. Benefits from partners who can provide security without pressure.",
    "AVOIDANT_STRONG_ANXIOUS_STRONG": "Extreme internal conflict between strong independence drive and strong connection needs. May alternate between emotional shutdown and desperate reaching for reassurance. Very challenging pattern requiring patient understanding.",
    "AVOIDANT_STRONG_SECURE_MODERATE": "Generally stable and independent with capacity for connection when not pressured. Values autonomy highly but can maintain relationships with secure partners. May appear emotionally distant but has underlying trust in relationship stability.",
    "AVOIDANT_STRONG_DISORGANIZED_MODERATE": "Strong independence needs combined with conflicted feelings about closeness. May withdraw when things feel too intimate but also struggle with complete emotional distance. Needs partners who respect complexity.",
    "SECURE_STRONG_ANXIOUS_MODERATE": "Fundamentally trusts relationships but has notable need for reassurance during stress. Generally emotionally available and communicative with periods of relationship worry. Strong foundation with manageable anxiety patterns.",
    "SECURE_STRONG_AVOIDANT_MODERATE": "Secure foundation with strong appreciation for independence. Can maintain closeness while requiring significant personal space. Generally stable with good balance between connection and autonomy.",
    "SECURE_STRONG_DISORGANIZED_MODERATE": "Generally stable and trusting but with periods of conflicted feelings about intimacy. Can usually maintain relationships despite occasional push-pull dynamics. Benefits from patient partners during confusing moments.",
    "DISORGANIZED_STRONG_ANXIOUS_MODERATE": "Intense need for connection combined with chaotic approach to relationships. May have dramatic emotional swings around intimacy. Requires extremely patient and consistent partners who can handle emotional intensity.",
    "DISORGANIZED_STRONG_AVOIDANT_MODERATE": "Conflicted between wanting and fearing closeness, with tendency to create distance as protection. May sabotage relationships when they feel too good or secure. Needs partners who understand contradictory patterns.",
    "DISORGANIZED_STRONG_SECURE_MODERATE": "Generally wants stable connection but has periods of confusing or contradictory behavior around intimacy. Can maintain relationships with patient partners who understand emotional complexity.",
    "ANXIOUS_MODERATE_AVOIDANT_STRONG": "Moderate need for reassurance complicated by strong independence drive. The avoidant patterns may dominate, creating relationships where connection is desired but consistently undermined by withdrawal.",
    "AVOIDANT_MODERATE_ANXIOUS_STRONG": "Moderate independence needs overwhelmed by strong anxiety patterns. May want space but panic when it's achieved. Creates unstable relationship dynamics requiring careful balance."
  },
  "systematicCombinations": {
    "typeDescriptions": {
      "ANXIOUS_AVOIDANT": "internal conflict between needing reassurance and wanting independence",
      "ANXIOUS_SECURE": "generally trusting foundation with notable need for extra reassurance during stress",
      "ANXIOUS_DISORGANIZED": "fear of abandonment combined with conflicted feelings about intimacy",
      "AVOIDANT_ANXIOUS": "independence drive complicated by underlying need for connection",
      "AVOIDANT_SECURE": "stable foundation with strong appreciation for autonomy and healthy boundaries",
      "AVOIDANT_DISORGANIZED": "independence needs combined with conflicted feelings about closeness",
      "SECURE_ANXIOUS": "stable relationship foundation with periods of worry about connection security",
      "SECURE_AVOIDANT": "secure base with healthy balance between intimacy and independence",
      "SECURE_DISORGANIZED": "generally stable with occasional periods of conflicted feelings about intimacy",
      "DISORGANIZED_ANXIOUS": "chaotic intimacy patterns intensified by fear of abandonment",
      "DISORGANIZED_AVOIDANT": "conflicted feelings about closeness combined with tendency to withdraw for protection",
      "DISORGANIZED_SECURE": "desire for stable connection complicated by periods of emotional confusion"
    },
    "intensityModifiers": {
      "STRONG_STRONG": "Creates intense internal conflict and very challenging relationship dynamics requiring professional support.",
      "STRONG_MODERATE": "Creates significant complexity with the primary pattern dominating most situations.",
      "STRONG_MILD": "Primary pattern dominates with occasional secondary influence during stress.",
      "STRONG_VERY_MILD": "Primary pattern dominates with rare secondary pattern emergence.",
      "MODERATE_STRONG": "Creates notable complexity with secondary pattern having significant influence on behavior.",
      "MODERATE_MODERATE": "Creates moderate relationship complexity requiring understanding partners.",
      "MODERATE_MILD": "Generally manageable with secondary pattern surfacing during difficult periods.",
      "MODERATE_VERY_MILD": "Mostly straightforward with minimal secondary pattern influence.",
      "MILD_STRONG": "Secondary pattern often overwhelms the mild primary, creating confusing dynamics.",
      "MILD_MODERATE": "Secondary pattern frequently influences behavior despite mild primary.",
      "MILD_MILD": "Both patterns present but neither dominates, creating flexible attachment style.",
      "MILD_VERY_MILD": "Very mild overall patterns with subtle attachment tendencies.",
      "VERY_MILD_STRONG": "Secondary pattern dominates despite very mild primary attachment style.",
      "VERY_MILD_MODERATE": "Secondary pattern is the main influence on attachment behavior.",
      "VERY_MILD_MILD": "Minimal overall attachment patterns with slight tendencies.",
      "VERY_MILD_VERY_MILD": "Very minimal attachment patterns overall."
    },
    "patternDescriptions": {
      "highInternalConflict": "Experiences push-pull tension between wanting closeness and needing distance.",
      "strongRegulationCapacity": "Maintains emotional stability and calm even during relationship stress.",
      "balancedButActivated": "Shows moderate levels across all patterns; ambivalent but not extreme.",
      "pureAvoidantWithdrawal": "Maintains strong emotional distance through self-sufficiency and independence.",
      "avoidantWithHiddenAnxiety": "Withdraws to stay safe, but underlying anxiety makes distance painful.",
      "secureLeaningAvoidant": "Generally comfortable with distance but can stay open during difficulty.",
      "defensiveShutdown": "Disengages under stress to prevent overload; needs calm time before reconnection.",
      "pureAnxiousPursuit": "Actively seeks reassurance and reconnection when feeling insecure.",
      "conflictedAnxious": "Desires closeness but sometimes pulls back when it feels overwhelming.",
      "secureLeaningAnxious": "Usually manages anxiety well but seeks extra reassurance during stress.",
      "reactivePursuit": "Reaches out urgently when feeling unseen; intensity masks fear of loss.",
      "chaoticAnxious": "Swings between closeness and panic; connection feels both vital and threatening.",
      "chaoticAvoidant": "Wants connection but withdraws unpredictably when it feels too close.",
      "unstableRegulation": "Emotional responses shift rapidly; hard to predict what will help.",
      "healingDisorganized": "Working toward more stable patterns; some push-pull remains but improving.",
      "integratedSecure": "Balances closeness and autonomy; regains calm quickly after tension.",
      "secureWithTendencies": "Generally secure with some anxious or avoidant leanings in specific situations."
    }
  },
  "notablePatterns": {
    "highInternalConflict": "You carry a real contradiction inside yourself—wanting closeness while also needing distance. This conflict can make relationships feel exhausting, but understanding it is the first step toward finding more peace.",
    "defensiveShutdown": "When stress hits, you tend to shut down emotionally to protect yourself. It's not that you don't care—you're preventing overwhelm. The challenge is finding your way back to connection after you've had the breathing room you need.",
    "avoidantWithHiddenAnxiety": "You create distance to feel safe, but underneath that withdrawal, there's anxiety about connection. You're protecting yourself from something that matters to you—which is why it hurts even when you're the one stepping back.",
    "reactivePursuit": "When you feel unseen or disconnected, you reach out with real urgency. The intensity isn't about being dramatic—it's about how much connection matters to you and how painful it feels when it seems threatened.",
    "conflictedAnxious": "You want closeness but sometimes pull back when you actually get it. There's a part of you that fears intimacy even as another part craves it. This contradiction can be confusing for both you and those close to you.",
    "strongRegulationCapacity": "You have a real strength in staying emotionally steady, even when relationships get difficult. This ability to stay calm and balanced is a gift—both to yourself and to the people in your life.",
    "secureLeaningAvoidant": "You value your independence but can stay open and engaged when things get hard. You've found a way to need space without disappearing completely—a balance many people struggle to achieve.",
    "secureLeaningAnxious": "Most of the time, you trust relationships and stay grounded. It's mainly during bigger stresses that you need extra reassurance. Knowing this about yourself helps you ask for what you need without shame."
  }
}
