{
  "dimensions": {
    "mindfulness": {
      "LOW_MINDFULNESS": {
        "reflection": "You often move through life on autopilot, missing the signals from your body and emotions when they first arise. Your attention tends to be scattered across multiple things, making it difficult to stay present with what you're experiencing in the moment.\n\nWhen feelings surface, you might notice them only after they've already influenced your actions or mood. This isn't a failure—it's simply where your attention naturally goes when you're focused on the practical demands of daily life.\n\nThe concept of deliberately tuning into your inner world might feel foreign or impractical, and that resistance to slowing down might be telling you something important.",
        "behavioralProfile": "Early stage of present-moment awareness. Life experienced largely through autopilot patterns. Internal experiences go unnoticed until they reach high intensity. Benefits from very gentle introduction to mindfulness concepts and basic awareness practices. Growth requires building the foundational habit of pausing and noticing."
      },
      "MODERATE_MINDFULNESS": {
        "reflection": "You sometimes catch yourself in the middle of an experience and think, 'Oh, this is what I'm actually feeling right now.' These moments of recognition come and go—sometimes you're tuned in, other times you're somewhere else entirely.\n\nYou might find yourself noticing your breath during a stressful moment, or catching tension in your shoulders partway through the day. The idea of being more present appeals to you, even if consistency feels challenging.\n\nWhen you do remember to pause and tune in, you often discover layers of experience that were there all along, waiting to be acknowledged.",
        "behavioralProfile": "Developing present-moment awareness with variable consistency. Can access mindful attention situationally but struggles to maintain it under stress or distraction. Shows genuine interest in mindfulness though practice is inconsistent. Benefits from regular practice structure and support in normalizing the uneven nature of development."
      },
      "GOOD_MINDFULNESS": {
        "reflection": "You have cultivated a genuine relationship with the present moment and regularly tune into what's happening inside you. Throughout your day, you find yourself naturally checking in with your breath, noticing physical sensations, or observing your emotional state as it unfolds.\n\nYou've learned to catch experiences closer to when they arise, giving you more choice in how you respond. This awareness isn't perfect or constant, but it's reliable enough that you can access it when you need it most.\n\nYour ability to stay present has become a valuable resource, especially during challenging or intense moments.",
        "behavioralProfile": "Well-established present-moment awareness with reliable consistency. Can maintain mindful attention in most contexts including moderate stress. Mindfulness feels increasingly natural rather than effortful. Benefits from deepening practice and exploring subtle dynamics. Recovery after challenging moments is relatively quick."
      },
      "HIGH_MINDFULNESS": {
        "reflection": "Present-moment awareness has become woven into the fabric of your daily experience. You naturally rest in awareness of your breath, body, thoughts, and emotions throughout the day without having to remember to pay attention.\n\nWhen intense experiences arise, you can meet them with a spacious, accepting presence that doesn't get swept away by the content. Your mindfulness isn't effortful—it's become a natural way of being that supports both your inner stability and your capacity to be fully present with others.\n\nThis consistent presence has become one of your greatest strengths.",
        "behavioralProfile": "Deeply integrated present-moment awareness as natural way of being. Mindfulness sustained across contexts and stress levels with minimal effort. Benefits from subtle refinement rather than major developmental work. Well-positioned to support others and maintain growth through life transitions. Foundation is stable and self-sustaining."
      }
    },
    "awareness": {
      "LOW_AWARENESS": {
        "reflection": "When strong feelings arise, they can feel overwhelming or confusing, and you might find yourself reacting before you understand what's really happening inside you. You often experience emotions and sensations as things that happen to you rather than experiences that carry information about your needs or circumstances.\n\nThe deeper meaning behind your reactions—what triggered them, what they're pointing toward, or how they connect to your broader patterns—often remains unclear. This isn't about intelligence; it's about not yet having developed the habit of curious self-inquiry.\n\nYour emotional life is real and valid, even when its messages feel mysterious.",
        "behavioralProfile": "Early stage of self-understanding with limited pattern recognition. Internal experiences felt directly without insight into their meaning or origins. Benefits from gentle guidance in connecting feelings to circumstances and needs. Growth requires building curiosity about inner world and tolerance for self-exploration."
      },
      "MODERATE_AWARENESS": {
        "reflection": "You sometimes reflect on your feelings and gain insight into what they mean, but this understanding isn't always consistent or available in the moment. There are times when you can step back and think, 'Oh, I see what that was really about,' but other times your reactions remain puzzling.\n\nYou're developing the ability to connect your emotions to your needs, past experiences, or current circumstances, though this skill is still emerging. You have moments of clarity about your patterns, but you don't always trust or act on these insights.\n\nThis developing awareness is valuable—it's the foundation for deeper self-understanding.",
        "behavioralProfile": "Developing self-reflective capacity with inconsistent insight. Can recognize patterns situationally but understanding isn't always accessible in the moment. Shows growing curiosity about inner dynamics. Benefits from practices that strengthen connection between experiences and their meanings. Growth comes through consistent self-inquiry."
      },
      "GOOD_AWARENESS": {
        "reflection": "You've developed a reliable ability to reflect on your emotions and connect them to deeper needs, patterns, or circumstances. When something triggers you, you can often pause and ask, 'What's really going on here?' and find meaningful answers.\n\nYou recognize your patterns—how you respond to criticism, what situations bring out different sides of you, how your past experiences influence your present reactions. This self-awareness gives you choices about how to respond rather than being driven by unconscious reactions.\n\nWhile you don't understand everything about yourself, you have solid tools for self-inquiry and growing insight.",
        "behavioralProfile": "Well-developed self-understanding with reliable pattern recognition. Can trace experiences to underlying dynamics in most situations. Self-inquiry feels natural and productive. Benefits from exploring subtle patterns and integration with other life areas. Understanding deepens with continued attention and practice."
      },
      "HIGH_AWARENESS": {
        "reflection": "You possess a deep, nuanced understanding of your inner world and can see the complex connections between your emotions, needs, history, and current circumstances. When challenging feelings arise, you can usually trace them to their roots and understand not just what you're feeling, but why, and what it means in the larger context of your life.\n\nYou're aware of your unconscious patterns, your growth edges, and the subtle ways your past influences your present. This level of self-awareness allows you to meet yourself with compassion and make conscious choices about how to respond to life's challenges.\n\nYour understanding of your inner landscape has become a powerful guide for growth.",
        "behavioralProfile": "Deeply integrated self-understanding with sophisticated pattern recognition. Can trace experiences to complex underlying dynamics with nuance and clarity. Self-inquiry is effortless and revealing. Benefits from subtle refinement and supporting others' development. Understanding serves as stable foundation for conscious living."
      }
    }
  },
  "combinations": {
    "LOW_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You often move through life on autopilot, missing the signals from your body and emotions. When strong feelings arise, they can feel overwhelming or confusing. In relationships, this can make it harder to notice your partner's needs or manage conflicts calmly, but even small steps in awareness will create more connection.\n\nThis is a natural starting point—your first step is simply noticing small moments, like your breath or a body sensation. Each moment of awareness is progress.",
      "behavioralProfile": "Early stage of both present-moment awareness and self-understanding. Life experienced through autopilot with limited insight into patterns. Internal states go unnoticed until intense and remain unclear in their meaning. Benefits from very gentle, foundational practices that build both noticing capacity and curiosity about inner world."
    },
    "LOW_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You sometimes gain insight into your emotional patterns, but you often realize what was happening only after the fact. You might think, 'Oh, that's why I reacted that way,' but in the moment, you were swept along by the experience without awareness.\n\nYour understanding of yourself is growing, but it's not yet connected to moment-to-moment presence. When you do catch yourself in the present, you might recognize patterns more quickly, but those moments are still rare.\n\nBuilding more consistent present-moment awareness would help you access your insights when you need them most.",
      "behavioralProfile": "Developing self-understanding without consistent present-moment foundation. Can reflect on patterns in hindsight but misses them unfolding in real-time. Understanding exists but isn't accessible during experiences. Benefits from practices that bridge insight and presence, bringing awareness into the moment."
    },
    "LOW_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You have a solid understanding of your emotional patterns and can make sense of your reactions when you reflect on them. The challenge is that this insight often comes too late—after you've already responded in a habitual way.\n\nYou know yourself well in theory, but in the heat of the moment, that knowledge isn't available to guide your choices. It's like having a map but not noticing where you are until you've already taken the wrong turn.\n\nDeveloping more present-moment awareness would help you access your considerable self-knowledge in real-time, allowing your insights to inform your responses as situations unfold.",
      "behavioralProfile": "Strong self-understanding disconnected from present-moment experience. Can analyze patterns with sophistication in reflection but cannot access this understanding as situations unfold. Insight exists without awareness to implement it. Benefits from mindfulness practices that ground understanding in real-time noticing."
    },
    "LOW_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You possess deep insight into your inner world—you understand your patterns, triggers, and needs with impressive clarity. Yet there's a gap between what you know about yourself and your ability to be present with your experience as it unfolds.\n\nYour understanding is sophisticated and accurate, but it lives primarily in reflection rather than in the lived moment. You might find yourself thinking, 'I knew that would happen,' or 'I understand exactly why I did that,' but these insights come after the fact.\n\nImagine what would be possible if your deep self-knowledge could meet each moment as it arrives, rather than analyzing it afterward.",
      "behavioralProfile": "Exceptional self-understanding without present-moment grounding. Sophisticated insight into patterns that remains intellectual rather than embodied. Can analyze dynamics with rare depth but cannot bring awareness into unfolding experience. Benefits from mindfulness practices that bridge the gap between knowing and being present."
    },
    "MODERATE_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You sometimes catch yourself being present—noticing your breath, feeling a body sensation, or recognizing that you're caught up in thought. These moments of awareness are valuable, but you're not yet sure what to do with them or what they mean.\n\nWhen you do tune into the present moment, you might notice you're anxious or upset but not understand why, or what the feeling is trying to tell you. Your presence is developing, but the insight to make meaning of what you notice is still emerging.\n\nAs you continue to build present-moment awareness, developing the ability to understand what you're experiencing will deepen the value of your practice.",
      "behavioralProfile": "Developing present-moment awareness without corresponding insight. Can notice internal states as they arise but cannot interpret their meaning or connect to patterns. Presence exists but understanding lags behind. Benefits from practices that develop both noticing and meaning-making capacities together."
    },
    "MODERATE_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You're building both the ability to be present with your experience and the capacity to understand what your feelings mean. These skills are developing together, though neither is yet consistent or reliable.\n\nSometimes you can catch yourself in a moment, understand what's happening, and even make a conscious choice about how to respond. Other times, you're somewhere else entirely or confused about what you're experiencing. This variability is normal—both skills take time to develop and stabilize.\n\nWith continued practice, these abilities will support each other: presence helps you access insight in the moment, and understanding helps you know what to do with the awareness you're cultivating.",
      "behavioralProfile": "Building both present-moment awareness and self-understanding with variable success. Both capacities emerging but neither yet stable or integrated. Can occasionally access both skills simultaneously but struggles to maintain them. Benefits from regular practice structure that develops both dimensions in parallel."
    },
    "MODERATE_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You understand yourself well and can make sense of your emotional patterns with clarity. Your challenge is that you don't always catch yourself in time to use this understanding. When you do notice what's happening in the moment, your self-awareness helps you respond more consciously.\n\nYou're in a powerful position—you have the insight, you just need more consistent access to it in real-time. Each time you catch yourself being present, you have the knowledge to understand what's happening and make conscious choices.\n\nStrengthening your moment-to-moment awareness would help you leverage your considerable self-understanding more consistently.",
      "behavioralProfile": "Strong self-understanding with developing present-moment awareness. Insight is sophisticated but access to it during experiences is inconsistent. When presence and understanding align, can respond consciously. Benefits from mindfulness practices that make real-time awareness more reliable and automatic."
    },
    "MODERATE_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You possess deep self-knowledge and understand your patterns with impressive nuance. When you manage to be present with your experience as it unfolds, you can access this understanding and respond with real wisdom.\n\nThe gap isn't in your insight—it's in consistently being present enough to apply what you know. Your understanding is sophisticated; your presence is still developing. This combination means you have powerful moments of conscious response interspersed with periods of autopilot.\n\nAs your present-moment awareness becomes more reliable, you'll be able to live more consistently from the deep wisdom you've already cultivated.",
      "behavioralProfile": "Exceptional self-understanding with moderate present-moment awareness. Sophisticated insight occasionally accessible in real-time but not yet reliable. When presence catches up with understanding, can demonstrate rare wisdom. Benefits from dedicated mindfulness practice to match awareness capacity to insight level."
    },
    "GOOD_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You've developed a reliable ability to be present with your experience as it unfolds. You notice your breath, track body sensations, and can observe your thoughts and emotions arising in real-time. What you haven't yet developed is the ability to understand what these experiences mean.\n\nYou can be present with anxiety, for example, without understanding what it's trying to tell you or what triggered it. You're good at the 'what' of your experience—what you're feeling, sensing, thinking—but the 'why' remains unclear.\n\nDeveloping more insight into your patterns would help you make better use of the strong present-moment awareness you've cultivated.",
      "behavioralProfile": "Well-established present-moment awareness without corresponding self-understanding. Can notice internal states reliably but cannot interpret their meaning or recognize patterns. Presence is strong but insight lags significantly behind. Benefits from practices that develop meaning-making and pattern recognition alongside continued mindfulness."
    },
    "GOOD_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You have a reliable practice of present-moment awareness and a growing ability to understand what your experiences mean. Sometimes these capabilities come together beautifully—you notice what's happening and understand it in real-time, allowing you to respond with wisdom.\n\nOther times, you're present but puzzled by what you're experiencing, or you understand the pattern but only in hindsight. You're building toward integration, where your presence and your insight work seamlessly together.\n\nContinued development of your self-understanding would help you make fuller use of the strong mindfulness foundation you've established.",
      "behavioralProfile": "Well-established present-moment awareness with developing self-understanding. Can reliably notice internal states with growing capacity to interpret their meaning. Integration between presence and insight is emerging but inconsistent. Benefits from practices that deepen pattern recognition to match the strength of mindfulness foundation."
    },
    "GOOD_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You've developed both strong present-moment awareness and solid self-understanding. You can notice what's happening inside you as it unfolds and often understand what it means—why you're reacting this way, what need is present, how this connects to larger patterns in your life.\n\nThis combination gives you real choice. When you're triggered, you can pause, observe what's arising, understand its meaning, and choose how to respond. This doesn't mean you never struggle or react automatically, but you have reliable tools for conscious living.\n\nYour mindfulness and awareness are working together to support your growth and well-being.",
      "behavioralProfile": "Strong integration of present-moment awareness and self-understanding. Can notice internal states as they arise and interpret their meaning with reliability. Both capacities work together to support conscious responding. Benefits from continued refinement and integration across life domains."
    },
    "GOOD_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You bring together reliable present-moment awareness and deep self-understanding in a powerful combination. You can observe your experience as it unfolds and understand it with impressive depth and nuance—recognizing not just surface reactions but the complex layers of meaning beneath them.\n\nWhen challenges arise, you can be present with them and understand them, giving you remarkable capacity for conscious choice. Your mindfulness provides the space to observe, and your insight provides the understanding to respond wisely.\n\nThis integration of presence and understanding is a significant strength that serves both your own growth and your ability to support others.",
      "behavioralProfile": "Strong present-moment awareness integrated with exceptional self-understanding. Can notice experiences as they arise and interpret them with sophisticated insight. Presence and wisdom work seamlessly together. Benefits from subtle refinement and often well-positioned to support others' development."
    },
    "HIGH_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Your present-moment awareness is exceptional—you're consistently tuned into your breath, body, thoughts, and emotions as they arise. You can maintain this presence even during intense experiences, creating space and calm where others might be overwhelmed.\n\nWhat you haven't yet developed is insight into what these experiences mean. You're exquisitely aware of what's happening—the sensations in your chest, the racing thoughts, the shifting emotions—but the deeper significance might elude you.\n\nDeveloping more understanding of your patterns would add another dimension to your strong mindfulness practice, helping you not just be present with experience, but also understand its messages.",
      "behavioralProfile": "Exceptional present-moment awareness without corresponding self-understanding. Can maintain continuous presence with internal states but lacks insight into their meaning and patterns. Mindfulness highly developed while interpretive capacity remains basic. Benefits from practices that build pattern recognition and meaning-making to complement strong mindfulness foundation."
    },
    "HIGH_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You maintain consistent, effortless present-moment awareness throughout your daily life. You're naturally tuned into your internal experience as it unfolds. Your self-understanding is developing—you sometimes recognize patterns and make connections—but this insight doesn't yet match the depth of your presence.\n\nYou can be with whatever arises with remarkable steadiness, and you're growing in your ability to understand what it all means. When your presence and your insight align, you demonstrate real wisdom, but there are times when you're present with experience you don't fully understand.\n\nDeepening your self-awareness would create a more complete integration with your exceptional mindfulness.",
      "behavioralProfile": "Exceptional present-moment awareness with developing self-understanding. Maintains continuous presence while insight into patterns is still emerging. Can be with experiences skillfully but doesn't always understand their significance. Benefits from practices that deepen pattern recognition and self-inquiry to match mindfulness capacity."
    },
    "HIGH_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You've cultivated both exceptional present-moment awareness and solid self-understanding. You're naturally present with your experience as it unfolds, and you can usually understand what it means—connecting emotions to needs, recognizing patterns, seeing how past and present interweave.\n\nThis combination allows you to meet life's challenges with both presence and wisdom. You can be with difficult experiences without being overwhelmed, and you understand them well enough to respond consciously and effectively.\n\nYour integrated practice of mindfulness and awareness has become a stable foundation for conscious living and continued growth.",
      "behavioralProfile": "Exceptional present-moment awareness integrated with strong self-understanding. Maintains continuous presence while reliably interpreting experiences and recognizing patterns. Both capacities highly developed and working together seamlessly. Benefits from subtle refinement and well-positioned to support others."
    },
    "HIGH_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You've developed something rare: the integration of exceptional present-moment awareness with deep, nuanced self-understanding. You're effortlessly present with your experience as it unfolds, and you understand it with sophistication—seeing not just surface patterns but the subtle, complex dynamics that shape your inner life.\n\nWhen challenges arise, you can meet them with both spacious presence and penetrating insight. This isn't about never struggling; it's about having remarkable tools for working with whatever life brings. Your capacity to be with experience and understand it has become a stable foundation for your life.\n\nThis integration of mindfulness and awareness is a significant achievement that likely serves both your own growth and your capacity to support others on their journeys.",
      "behavioralProfile": "Exceptional integration of present-moment awareness and self-understanding. Maintains effortless presence while interpreting experiences with sophisticated insight. Both capacities highly developed and seamlessly integrated. Foundation is stable and self-sustaining. Well-positioned for advanced practice and supporting others' development."
    }
  },
  "notablePatterns": {
    "intellectualVsRealtime": "You can understand your emotions and thoughts insightfully - but often only in hindsight, not as they happen. Being present with what's unfolding right now is still challenging.",
    "observationWithoutAction": "You have a real capacity to observe your thoughts and feelings without getting tangled up. Yet when emotions run strong, you can still react automatically - that pause before responding is still developing.",
    "mindBodyDisconnect": "You can name what you feel and understand what sits behind it. But the connection to body sensations - tension, heartbeat, breath - isn't always clear yet.",
    "extremeLowPresence": "Much of your time is spent on autopilot - thoughts racing, days passing, inner experiences unnoticed. Pausing to feel what's happening here and now is rare.",
    "presenceWithoutDepth": "You're quite present in the moment and can notice what's happening. You haven't yet connected these moments to deeper patterns - why you feel the way you feel.",
    "exceptionalMindfulness": "You've developed something rare. You're present with life as it unfolds, can observe your mind without getting lost in it, pause before reacting, track what's happening inside you, and understand why you feel what you feel. This awareness will guide you.",
    "minimalMindfulness": "You're spending most of life on autopilot right now. Days pass, thoughts race, emotions come and go mostly unnoticed. Your body's signals are faint, and understanding what sits behind feelings is unclear. This is a starting place, and awareness can grow from here."
  },

  "behavioralPatterns": {
    "intellectualVsRealtime": "Can intellectually understand emotional patterns but misses them happening in real-time.",
    "observationWithoutAction": "Can observe thoughts without getting caught but still reacts automatically when triggered.",
    "awarenessWithoutIntegration": "Understands emotions conceptually but struggles to notice physical sensations and thought patterns as they arise.",
    "practiceWithoutPresence": "May have formal practice but struggles with daily-life mindfulness.",
    "presenceWithoutInsight": "Notices experiences in the moment but doesn't yet connect them to deeper patterns or needs.",
    "bodyAwarenessGap": "Present with thoughts and emotions but less connected to bodily sensations.",
    "reactiveUnderStress": "Can step back from thoughts in calm moments but loses this capacity when stressed or triggered.",
    "insightWithoutAwareness": "Has conceptual understanding of emotions but limited real-time awareness of internal states.",
    "observationWithoutFlexibility": "Can notice thoughts and feelings but response patterns remain automatic.",
    "strongMindfulnessIntegration": "Strong integration of mindfulness across dimensions. Present awareness reliable, observation skills developed, response flexibility established, internal states differentiated clearly, and emotional insight sophisticated.",
    "exceptionalMindfulness": "Exceptional mindfulness capacity. Present-moment awareness automatic, observation effortless, responses conscious and flexible, internal landscape mapped with precision, and emotional patterns understood deeply.",
    "nearComplete": "Near-complete mindfulness development with one dimension still maturing. Overall capacity strong and reliable with clear path for continued refinement.",
    "minimalMindfulness": "Mindfulness capacity limited across all dimensions. Autopilot dominant, observation difficult, reactivity high, internal states undifferentiated, and emotional insight minimal.",
    "multipleDeficits": "Mindfulness challenged in multiple areas. One area of relative strength provides starting point but overall capacity remains significantly underdeveloped.",
    "earlyStageAllAround": "Beginning mindfulness development from foundational level. Awareness skills underdeveloped across dimensions. Starting point for systematic practice and skill building.",
    "balancedDevelopment": "Developing mindfulness evenly across dimensions. Growth consistent without major imbalances. Foundation building steadily with regular practice.",
    "moderateMomentum": "Mindfulness developing well with clear momentum. All dimensions showing progress. Approaching strong capacity with continued practice.",
    "stableMiddleRange": "Consistent moderate mindfulness across areas. Development stable though not yet automatic. Regular practice maintaining steady progress.",
    "formalPracticeNoTransfer": "May have developed mindfulness skills through formal practice but struggles to bring awareness into daily life. Meditation cushion skills haven't fully transferred to real-world contexts.",
    "naturalPresenceNoStructure": "Naturally present and aware in daily life without formal practice foundation. Presence is intuitive but lacks structure for deeper insight development.",
    "bodySeparation": "Can understand emotions and their meanings but body awareness significantly disconnected. Lives primarily in head with limited somatic integration.",
    "hyperVigilantObservation": "Highly developed observation capacity but limited present-moment grounding. May observe with anxiety-driven hypervigilance rather than relaxed awareness.",
    "reactionGapDespiteAwareness": "Can be present and observe clearly but reactions remain automatic. Awareness doesn't yet translate into behavioral flexibility or conscious response.",
    "insightWithoutFoundation": "Sophisticated emotional insight developed without strong foundational awareness. Understanding is intellectual or retrospective rather than grounded in real-time noticing.",
    "presenceWithoutDifferentiation": "Present with experience but internal states remain undifferentiated. Notices something is happening but can't separate thoughts from emotions from sensations.",
    "allButInsight": "Strong mindfulness skills across awareness and observation but limited insight into emotional meaning. Can notice and not react but doesn't understand what feelings are pointing toward.",
    "bodyMindDissociation": "Understands emotions conceptually but body awareness severely limited. Marked dissociation between cognitive understanding and somatic experience.",
    "flexibilityWithoutObservation": "Can pause and respond flexibly but observation skills underdeveloped. Flexibility comes from effort or technique rather than observational spaciousness.",
    "presentButReactive": "Highly present and aware of unfolding experience but reactivity remains high. Notices everything but responds automatically without pause.",
    "fragmentedAwareness": "Isolated area of mindfulness strength while other dimensions remain underdeveloped. Awareness fragmented rather than integrated across experience."
  }
}
