{
  "dimensions": {
    "mindfulness": {
      "LOW_MINDFULNESS": {
        "reflection": "You often move through life on autopilot, missing the signals from your body and emotions when they first arise. Your attention tends to be scattered across multiple things, making it difficult to stay present with what you're experiencing in the moment.\n\nWhen feelings surface, you might notice them only after they've already influenced your actions or mood. This isn't a failure—it's simply where your attention naturally goes when you're focused on the practical demands of daily life.\n\nThe concept of deliberately tuning into your inner world might feel foreign or impractical, and that resistance to slowing down might be telling you something important.",
        "behavioralProfile": "Operates primarily on autopilot with minimal awareness of internal states. Tends to notice emotions and sensations after they've already influenced behavior. May feel overwhelmed when asked to focus inward. Benefits from very gentle, external cues to build basic present-moment awareness."
      },
      "MODERATE_MINDFULNESS": {
        "reflection": "You sometimes catch yourself in the middle of an experience and think, 'Oh, this is what I'm actually feeling right now.' These moments of recognition come and go—sometimes you're tuned in, other times you're somewhere else entirely.\n\nYou might find yourself noticing your breath during a stressful moment, or catching tension in your shoulders partway through the day. The idea of being more present appeals to you, even if consistency feels challenging.\n\nWhen you do remember to pause and tune in, you often discover layers of experience that were there all along, waiting to be acknowledged.",
        "behavioralProfile": "Developing present-moment awareness with inconsistent application. Can notice internal states when prompted or reminded. Shows genuine interest in mindfulness but struggles with consistent practice. Benefits from gentle reminders and structured mindfulness activities."
      },
      "GOOD_MINDFULNESS": {
        "reflection": "You have cultivated a genuine relationship with the present moment and regularly tune into what's happening inside you. Throughout your day, you find yourself naturally checking in with your breath, noticing physical sensations, or observing your emotional state as it unfolds.\n\nYou've learned to catch experiences closer to when they arise, giving you more choice in how you respond. This awareness isn't perfect or constant, but it's reliable enough that you can access it when you need it most.\n\nYour ability to stay present has become a valuable resource, especially during challenging or intense moments.",
        "behavioralProfile": "Established mindfulness practice with reliable present-moment awareness. Can consistently notice internal states as they arise. Uses mindfulness as a tool for emotional regulation and conscious responding. Shows capacity for sustained attention and non-reactive observation."
      },
      "HIGH_MINDFULNESS": {
        "reflection": "Present-moment awareness has become woven into the fabric of your daily experience. You naturally rest in awareness of your breath, body, thoughts, and emotions throughout the day without having to remember to pay attention.\n\nWhen intense experiences arise, you can meet them with a spacious, accepting presence that doesn't get swept away by the content. Your mindfulness isn't effortful—it's become a natural way of being that supports both your inner stability and your capacity to be fully present with others.\n\nThis consistent presence has become one of your greatest strengths.",
        "behavioralProfile": "Highly developed, integrated mindfulness practice. Maintains consistent present-moment awareness throughout daily activities. Can remain centered during intense experiences. Uses advanced mindfulness skills for both personal regulation and supporting others' well-being."
      }
    },
    "awareness": {
      "LOW_AWARENESS": {
        "reflection": "When strong feelings arise, they can feel overwhelming or confusing, and you might find yourself reacting before you understand what's really happening inside you. You often experience emotions and sensations as things that happen to you rather than experiences that carry information about your needs or circumstances.\n\nThe deeper meaning behind your reactions—what triggered them, what they're pointing toward, or how they connect to your broader patterns—often remains unclear. This isn't about intelligence; it's about not yet having developed the habit of curious self-inquiry.\n\nYour emotional life is real and valid, even when its messages feel mysterious.",
        "behavioralProfile": "Limited insight into emotional patterns and triggers. Tends to experience emotions at face value without understanding their deeper meaning. May feel confused by own reactions. Benefits from gentle guidance in connecting feelings to needs and circumstances."
      },
      "MODERATE_AWARENESS": {
        "reflection": "You sometimes reflect on your feelings and gain insight into what they mean, but this understanding isn't always consistent or available in the moment. There are times when you can step back and think, 'Oh, I see what that was really about,' but other times your reactions remain puzzling.\n\nYou're developing the ability to connect your emotions to your needs, past experiences, or current circumstances, though this skill is still emerging. You have moments of clarity about your patterns, but you don't always trust or act on these insights.\n\nThis developing awareness is valuable—it's the foundation for deeper self-understanding.",
        "behavioralProfile": "Developing self-reflective capacity with inconsistent insight. Can sometimes connect emotions to underlying causes or needs. Shows growing curiosity about inner patterns. Benefits from practices that strengthen the connection between feelings and their meanings."
      },
      "GOOD_AWARENESS": {
        "reflection": "You've developed a reliable ability to reflect on your emotions and connect them to deeper needs, patterns, or circumstances. When something triggers you, you can often pause and ask, 'What's really going on here?' and find meaningful answers.\n\nYou recognize your patterns—how you respond to criticism, what situations bring out different sides of you, how your past experiences influence your present reactions. This self-awareness gives you choices about how to respond rather than being driven by unconscious reactions.\n\nWhile you don't understand everything about yourself, you have solid tools for self-inquiry and growing insight.",
        "behavioralProfile": "Well-developed self-reflective abilities with consistent insight into emotional patterns. Can identify triggers, needs, and behavioral patterns with clarity. Uses self-awareness for conscious choice-making. Shows capacity for meaningful self-inquiry and pattern recognition."
      },
      "HIGH_AWARENESS": {
        "reflection": "You possess a deep, nuanced understanding of your inner world and can see the complex connections between your emotions, needs, history, and current circumstances. When challenging feelings arise, you can usually trace them to their roots and understand not just what you're feeling, but why, and what it means in the larger context of your life.\n\nYou're aware of your unconscious patterns, your growth edges, and the subtle ways your past influences your present. This level of self-awareness allows you to meet yourself with compassion and make conscious choices about how to respond to life's challenges.\n\nYour understanding of your inner landscape has become a powerful guide for growth.",
        "behavioralProfile": "Highly developed self-awareness with sophisticated understanding of internal patterns and dynamics. Can trace emotions to complex underlying causes. Shows advanced capacity for self-inquiry, pattern recognition, and conscious choice-making. Uses deep self-knowledge for personal growth and helping others."
      }
    }
  },
  "combinations": {
    "LOW_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You often move through life on autopilot, missing the signals from your body and emotions. When strong feelings arise, they can feel overwhelming or confusing. In relationships, this can make it harder to notice your partner's needs or manage conflicts calmly, but even small steps in awareness will create more connection.\n\nThis is a natural starting point—your first step is simply noticing small moments, like your breath or a body sensation. Each moment of awareness is progress.",
      "behavioralProfile": "Operates primarily on autopilot with minimal awareness of internal states and limited understanding of emotional patterns. May feel overwhelmed by both the immediate experience of emotions and their underlying meanings. Benefits from very gentle, structured approaches to building basic awareness."
    },
    "LOW_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You sometimes reflect on your feelings and gain insight, but in the moment you tend to miss what's happening inside you. This can leave you with understanding after the fact, but less ability to respond while it's unfolding.\n\nIn relationships, this may mean you realize later what was really going on for you, so practicing presence will help you share openly and respond in the moment. Simple mindfulness practices will help you connect your insights to real-time awareness.",
      "behavioralProfile": "Has developing insight into emotional patterns but struggles to access this awareness in real-time. Can reflect on experiences afterward but misses opportunities for conscious response in the moment. Benefits from practices that bridge reflection and presence."
    },
    "LOW_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You have a strong ability to reflect on your emotions and connect them to your needs or patterns. Yet, you may overlook them as they arise in the moment, which limits your ability to act on your insights right away.\n\nIn relationships, this allows you to understand yourself well but sometimes miss opportunities to communicate or adjust in real time. Cultivating present-moment attention will let you apply your reflections in practice when it matters most.",
      "behavioralProfile": "Strong self-reflective abilities but limited present-moment awareness. Can understand emotional patterns deeply but may miss opportunities to apply this understanding when it would be most helpful. Benefits from mindfulness practices that support real-time application of insights."
    },
    "LOW_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You understand yourself deeply and can see the meaning behind your emotions, but you often miss catching them as they happen. This means your insights may arrive 'too late' to change your immediate reactions.\n\nIn relationships, this may mean you can explain your needs later but struggle to stay calm or responsive in the heat of the moment. Focusing on grounding practices—like mindful breathing or pausing in the moment—will help bridge your awareness into daily life.",
      "behavioralProfile": "Highly developed self-awareness with sophisticated understanding of emotional patterns, but limited ability to access this wisdom in real-time. May have excellent post-hoc insights but struggle with in-the-moment conscious responding. Benefits from practices that bridge deep awareness with present-moment attention."
    },
    "MODERATE_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You sometimes notice your inner experiences as they happen, but you may not understand what they mean or how they connect to your needs. This can leave you with awareness but little clarity.\n\nIn relationships, you may notice tension rising but not know how to express what you're really feeling, which can create misunderstandings. Reflection practices like journaling or asking, 'What is this feeling pointing to?' can strengthen your self-awareness.",
      "behavioralProfile": "Developing present-moment awareness but limited understanding of what internal experiences mean. Can notice that something is happening but may struggle to interpret or respond appropriately. Benefits from practices that develop interpretive and reflective skills."
    },
    "MODERATE_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You occasionally notice your emotions and sometimes reflect on their meaning, though both skills are still developing. You're starting to balance presence and understanding, but it may feel inconsistent.\n\nIn relationships, you can sometimes catch yourself and share what you feel, but consistency will make your communication and empathy stronger. Gentle daily practices—like a short mindful pause followed by a reflection—will help stabilize this balance.",
      "behavioralProfile": "Developing both present-moment awareness and self-reflective capacity. Shows promise in both areas but lacks consistency. Can sometimes access both skills simultaneously but needs support to strengthen and stabilize these developing capacities."
    },
    "MODERATE_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You often reflect well on your experiences, and you're learning to notice them in the moment. While you may miss some signals or slip into autopilot, your foundation is solid.\n\nIn relationships, this helps you share your feelings with growing clarity, though you may still need to pause before reacting in challenging moments. With consistent mindfulness practice, your reflections will become more immediate and empowering.",
      "behavioralProfile": "Good self-reflective abilities with developing present-moment awareness. Has solid understanding of emotional patterns and is learning to apply this awareness in real-time. Shows capacity for conscious responding when able to access both skills simultaneously."
    },
    "MODERATE_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You deeply understand your emotions and patterns, and you sometimes catch them in real time. Still, your mindfulness isn't always consistent, so your insights may not always guide your responses in the moment.\n\nIn relationships, this means you understand what drives you but may still overreact at times—building steadier presence will help you express needs calmly. Strengthening daily mindfulness habits will help you live out your deep self-awareness more fully.",
      "behavioralProfile": "Highly developed self-awareness with moderate present-moment awareness. Has sophisticated understanding of internal patterns but inconsistent ability to access this wisdom when most needed. Benefits from strengthening mindfulness to better integrate deep insights with conscious responding."
    },
    "GOOD_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You are present and can notice emotions and sensations clearly, but you may struggle to interpret what they mean. You see the 'what' but not always the 'why.'\n\nIn relationships, this helps you stay calm and grounded, though your partner may wish for more depth in understanding and sharing your inner world. Reflection tools—like identifying needs or linking emotions to past experiences—will enrich your awareness with meaning.",
      "behavioralProfile": "Strong present-moment awareness with limited interpretive skills. Can clearly observe internal experiences but may struggle to understand their significance or meaning. Benefits from developing reflective and analytical skills to complement observational abilities."
    },
    "GOOD_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You notice much of what happens inside you and sometimes connect it to deeper needs. While your presence is solid, your insight is still developing.\n\nIn relationships, this balance helps you stay present with others, though at times you may struggle to express the full meaning of your feelings. With practice, you can expand your ability to see the bigger picture behind your emotions. This will make your mindful awareness even more powerful.",
      "behavioralProfile": "Strong present-moment awareness with developing self-reflective capacity. Can reliably notice internal experiences and sometimes understand their meaning. Shows promise in connecting mindful observation with deeper insight."
    },
    "GOOD_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You have a strong ability to both notice your experiences in the moment and reflect on their meaning. These skills reinforce each other, helping you meet challenges with growing clarity.\n\nIn relationships, this helps you navigate conflicts constructively and express your emotions in ways that invite connection and understanding. With ongoing practice, you'll deepen this into a natural and consistent way of living.",
      "behavioralProfile": "Well-developed integration of present-moment awareness and self-reflective abilities. Can both notice experiences as they arise and understand their deeper meaning. Shows strong capacity for conscious responding and emotional intelligence in relationships and daily life."
    },
    "GOOD_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You balance presence and deep insight well. You notice your emotions as they arise and often understand what they are pointing to. At times, challenges may still pull you off balance, but you have the tools to recover quickly.\n\nIn relationships, this means you can usually express your needs clearly and respond with care, even when emotions run high. Strengthening acceptance and compassion will make your awareness even more resilient.",
      "behavioralProfile": "Strong integration of present-moment awareness and sophisticated self-understanding. Can reliably access both observational and interpretive skills simultaneously. Shows advanced emotional intelligence and capacity for conscious, compassionate responding even during challenging situations."
    },
    "HIGH_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "You are very present and aware of what happens inside you, yet you may not often reflect on the deeper meaning of your emotions. You can observe clearly but may miss the 'message' behind your feelings.\n\nIn relationships, this presence helps you listen well and stay calm, though you may find it harder to share your deeper emotional needs. Practicing gentle self-inquiry—like asking, 'What is this emotion telling me?'—will connect presence to insight.",
      "behavioralProfile": "Highly developed present-moment awareness with limited interpretive skills. Can maintain consistent, non-reactive observation of internal experiences but may struggle to derive meaning or direction from these observations. Benefits from developing reflective and interpretive capacities."
    },
    "HIGH_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "You are consistently present in your daily life, and you sometimes interpret what your emotions mean. This gives you a stable base, but there is room to grow in linking experiences to your deeper needs or patterns.\n\nIn relationships, this helps you remain steady and attentive, though greater reflection will allow you to express your inner world more fully. Pairing mindfulness with reflection will strengthen the meaning-making side of your awareness.",
      "behavioralProfile": "Highly developed present-moment awareness with developing self-reflective capacity. Maintains consistent mindful presence and sometimes can interpret the meaning of experiences. Shows promise in integrating observational and interpretive skills."
    },
    "HIGH_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "You live with strong presence and good insight into your experiences. You can notice emotions in real time and often connect them to your needs or patterns. This balance gives you clarity and flexibility in how you respond to challenges.\n\nIn relationships, this balance helps you communicate clearly, listen with empathy, and create space for healthy, supportive connections. Continued practice will deepen your integration.",
      "behavioralProfile": "Strong integration of advanced present-moment awareness and well-developed self-reflective abilities. Can consistently notice experiences as they arise and understand their meaning. Shows high emotional intelligence and advanced capacity for conscious, responsive living."
    },
    "HIGH_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "You have developed an integrated awareness: you are consistently present and deeply insightful. You can notice emotions as they arise, understand their meaning, and respond with clarity and compassion.\n\nIn relationships, this allows you to meet others with empathy, authenticity, and balance, making your connections deeply supportive and nourishing. This is a powerful strength—your awareness flows naturally and supports your growth, relationships, and resilience.",
      "behavioralProfile": "Highly integrated awareness combining advanced mindfulness with sophisticated self-understanding. Can consistently access both observational and interpretive skills simultaneously. Shows mastery-level emotional intelligence and capacity for wise, compassionate responding in all areas of life."
    }
  }
}
