{
  "levels": {
    "BEGINNING_SELF_ACCEPTANCE": {
      "reflection": "You're starting to notice your inner patterns, though understanding them can be challenging. Your inner voice can be quite critical, and you might not always notice or feel what's happening inside you in the present moment. When strong emotions arise, they often feel overwhelming or like they're happening to you rather than experiences you can explore.\n\nYou sometimes judge your reactions as wrong or problematic rather than becoming curious about why they happen. There's often a sense of distance between you and your inner world, as though you're watching your life through glass sometimes.\n\nThis disconnection isn't something you chose—it often developed as protection when feeling everything would have been too overwhelming, and the way you minimize yourself probably made sense once, even if it doesn't now.",
      "behavioralProfile": "Early stage of self-reflective capacity. Self-observation is inconsistent and often reactive rather than proactive. Patterns are difficult to recognize without external prompting. Self-compassion practices feel unfamiliar or uncomfortable. Benefits from basic awareness exercises and structured guidance. Growth requires building foundational observer self."
    },
    "DEVELOPING_SELF_ACCEPTANCE": {
      "reflection": "You're growing in awareness of your emotional patterns and can sometimes observe yourself with curiosity rather than judgment. There are moments when you catch hints of your patterns and think, 'Oh, this is what I do when I feel threatened' or 'I notice I always respond this way when...'\n\nBut these insights don't always stick, and you might find yourself back in familiar cycles of self-judgment or emotional overwhelm. You're learning to be kinder to yourself, though your inner critic still shows up regularly. Sometimes you can be gentle with yourself when things don't go as planned, and other times that critical voice takes over with familiar harshness.\n\nYou're in an active phase of self-discovery, developing the ability to step back and observe your experience, but it's not yet consistent.",
      "behavioralProfile": "Building self-reflective abilities with variable consistency. Can recognize patterns in hindsight or when reminded, though real-time awareness remains challenging. Self-compassion emerges situationally but doesn't yet feel natural or automatic. Shows genuine interest in inner work. Benefits from practices that strengthen observing capacity and normalize the developmental process. Growth comes through regular practice and reducing perfectionism about the practice itself."
    },
    "GROWING_SELF_ACCEPTANCE": {
      "reflection": "You have good self-awareness and can often step back to observe your patterns without harsh judgment. You've developed genuine curiosity about your inner world and can often observe your emotions and reactions without immediately trying to fix or judge them.\n\nWhen something triggers you, you're increasingly able to pause and ask, 'What's really going on here?' rather than just being swept away by the feeling. You usually treat yourself with compassion and can accept different parts of yourself.\n\nYou're growing in compassion for yourself when you don't handle things perfectly, and you're learning to treat your mistakes as information rather than proof of inadequacy. You're developing a wise, supportive inner voice, though you still have moments when the old critical voice takes over.",
      "behavioralProfile": "Well-developed self-reflective capacity with reliable consistency. Can maintain awareness and respond with intention in most situations, including moderate stress. Self-compassion feels increasingly natural rather than effortful. Recognizes patterns as they unfold rather than only in retrospect. Benefits from exploring subtle dynamics and edge cases. Recovery after challenging moments is relatively quick. Ready for nuanced self-inquiry and integration with other areas of life."
    },
    "INTEGRATED_SELF_ACCEPTANCE": {
      "reflection": "You consistently meet yourself with curiosity and kindness. You can observe your emotions and reactions with clarity and compassion, holding all parts of yourself with acceptance. You've developed a strong, supportive relationship with yourself that has become one of your greatest resources.\n\nWhen challenging emotions arise, you can meet them with genuine curiosity and compassion, understanding they're part of your human experience rather than problems that need to be solved. You've cultivated a reliable inner observer—a part of you that can watch your thoughts and feelings with wisdom and love, even in difficult moments.\n\nYou recognize your patterns without being controlled by them, and when you fall into old cycles, you can find your way back to center with patience rather than self-attack.",
      "behavioralProfile": "Deeply integrated self-acceptance as foundational way of being. Self-compassion flows naturally across contexts and stress levels. Self-observation is effortless and continuous. Patterns recognized as they emerge with minimal lag time. Recovery from difficulty is quick and grounded. Benefits from subtle refinement rather than major developmental work. Well-positioned to support others and maintain growth through life transitions. Foundation is stable and self-sustaining."
    }
  },
  "opennessModifiers": {
    "RESTING_PHASE": {
      "modifier": "Right now you might feel overwhelmed, tired, or skeptical about change, and that's completely valid—sometimes we need rest and stability before being ready for growth.",
      "behavioralAddition": "Currently in rest/recovery phase. Not receptive to growth-oriented interventions. Needs validation, safety, and permission to pause rather than encouragement to change. May be experiencing burnout or overwhelm. Best approach: supportive presence without expectations."
    },
    "MIXED_FEELINGS": {
      "modifier": "Part of you wants to grow and change while another part feels uncertain or resistant, and this internal tension is normal and shows you're considering what growth might mean for you.",
      "behavioralAddition": "Experiencing ambivalence about change. Simultaneously desires growth and fears it. Benefits from gentle exploration of both sides without pressure to resolve. Needs validation of complexity and support in taking small, emotionally safe steps when ready."
    },
    "READY_TO_GROW": {
      "modifier": "You're motivated to make positive changes and ready to take action with the right support and tools, bringing energy and openness to growth work.",
      "behavioralAddition": "Actively motivated for change with clear readiness. Can engage with structured practices and goal-setting. Benefits from concrete suggestions and accountability. Energy available for consistent effort. Good time for introducing regular practices and deeper self-inquiry."
    },
    "DEEP_EXPLORATION": {
      "modifier": "You're excited about meaningful personal exploration and ready for significant inner work, open to challenging insights and major shifts in how you understand yourself.",
      "behavioralAddition": "Highly motivated for transformational work. Ready for deep self-inquiry, shadow work, and significant pattern exploration. Can handle challenging insights and contradictions. Benefits from advanced practices, archetypal exploration, and intensive reflection. Rare level of readiness for profound personal work."
    }
  },
  "notablePatterns": {
    "emotionalAcceptanceHarshVoice": "You have a real capacity to accept your emotions as they are. At the same time, your inner voice can be quite hard on you - especially when things are difficult. This contrast is worth being gentle with.",
    "compassionForOthersNotSelf": "You readily offer others gentleness and understanding. But with yourself - that same level of compassion and patience doesn't come through. What you'd give a friend rarely reaches you.",
    "stuckInPast": "You can accept what you feel in the present. But past mistakes and things you couldn't control still feel heavy. That weight hasn't fully been set down yet.",
    "extremeHarshVoice": "Your inner voice is consistently critical - especially when things are hard. It speaks in ways you'd never speak to someone you care about.",
    "pastPeaceNotPresentKindness": "You've made peace with your past - mistakes and circumstances no longer weigh on you. But this forgiveness hasn't yet translated into how you speak to yourself today.",
    "cannotSitWithEmotions": "Letting emotions be as they are - without needing to fix, understand, or change them - feels impossible. Sitting with discomfort is really hard.",
    "compassionGapWithPast": "You easily understand when others mess up - you know everyone's learning. But your own past mistakes are still hard to forgive. You hold yourself to a different standard.",
    "exceptionalIntegration": "You've built something really solid here. You can sit with your emotions, speak kindly to yourself even when things are hard, hold your past with understanding, and extend that same warmth to others. This foundation will serve you.",
    "pervasiveStruggle": "Right now, being kind to yourself feels really hard - in all the ways. Emotions feel overwhelming, your inner voice is harsh, the past weighs heavy, and even extending warmth to others is difficult. This isn't failure. This is where you're starting from, and it can shift."
  },

  "behavioralPatterns": {
    "emotionalAcceptanceHarshVoice": "Notable tension: accepts emotions fully but inner voice remains harsh. Can sit with difficult feelings but judges self for having them.",
    "compassionForOthersNotSelf": "Readily extends compassion to others but struggles to offer the same kindness to self.",
    "compassionGapWithPast": "Extends compassion readily to others but struggles to forgive own past mistakes.",
    "harshInnerVoice": "Inner voice is consistently harsh and critical, especially during stress.",
    "emotionalAcceptanceNotPast": "Can accept present emotions but carries weight of past mistakes. Emotional acceptance hasn't extended to self-forgiveness yet.",
    "limitedCompassion": "Limited compassion both inward and outward. May approach both self and others with judgment.",
    "pastPeaceNotPresent": "Has made peace with past but inner voice remains critical in present moments.",
    "emotionalResistance": "Struggles to allow emotions without trying to fix, understand, or change them immediately.",
    "strongFoundationWeakPast": "Strong self-compassion in present but past remains an area of struggle.",
    "compassionImbalance": "Marked difference between how compassionately treats others versus self.",
    "pastAcceptanceNotEmotional": "Can accept past mistakes but struggles to sit with present difficult emotions without fixing them.",
    "innerVoiceStressDependent": "Inner voice becomes significantly harsher under stress or when facing challenges.",
    "strongIntegration": "Strong self-acceptance foundation across all dimensions. Maintains self-compassion under stress, accepts emotions readily, holds past with understanding, and extends genuine compassion outward.",
    "exceptionalIntegration": "Exceptional integration of self-acceptance. Self-compassion automatic and stable, emotional acceptance effortless, past fully released, and compassion flows naturally in all directions.",
    "almostIntegrated": "Near-complete integration with one area still developing. Overall self-acceptance strong and reliable with room for growth in one dimension.",
    "pervasiveStruggle": "Self-acceptance limited across all dimensions. Self-criticism pervasive, emotional resistance high, past unresolved, and compassion scarce both inward and outward.",
    "multipleDeficits": "Self-acceptance challenged in multiple areas simultaneously. One area of relative strength provides foothold for development but overall capacity remains limited.",
    "beginningFromDifficulty": "Starting self-acceptance work from a place of significant challenge. Self-kindness feels foreign or impossible across contexts. This is a starting point, not a limitation.",
    "evenDevelopment": "Developing self-acceptance evenly across dimensions without major imbalances. Growth is gradual and consistent. Foundation building steadily.",
    "moderateWithPotential": "Self-acceptance developing well with visible momentum. All dimensions showing progress. Approaching integrated capacity with continued practice.",
    "stableMiddle": "Consistent moderate self-acceptance across areas. Development is stable though not yet automatic. Regular practice maintaining progress.",
    "emotionalPeaceHarshJudgment": "Can accept emotions with exceptional ease but inner voice remains severely critical. Paradox of being able to sit with feeling while simultaneously judging self for having it.",
    "compassionFlowsOneWay": "Compassion flows readily outward but rarely inward. Natural warmth toward others contrasts sharply with limited self-kindness across multiple dimensions.",
    "presentAcceptancePastGrip": "Strong self-acceptance in present moment but past maintains disproportionate grip. Can be kind and accepting now but historical wounds remain unresolved.",
    "pastReleaseEmotionalBlock": "Has released past but struggles with present emotions. Made peace with history but hasn't developed capacity to sit with current feeling states.",
    "innerVoiceOnlyDeficit": "Self-acceptance strong in all areas except inner dialogue. Can accept emotions, release past, and extend compassion, but self-talk remains harsh island of struggle.",
    "emotionalAcceptanceOnlyStrength": "Exceptional capacity for emotional acceptance stands alone. Can sit with feelings with rare skill while other dimensions of self-acceptance remain underdeveloped.",
    "compassionWithoutEmotionalAcceptance": "Can extend compassion to others while being unable to accept own emotions. Understands others' struggles intellectually but can't tolerate own feeling states.",
    "allButCompassion": "Strong self-acceptance inwardly but limited extension outward. Has done inner work but compassion hasn't yet generalized to include others.",
    "selectiveHarshness": "Self-compassion present and reliable in some contexts but inner voice becomes harsh under specific triggers. Pattern suggests conditional rather than integrated self-acceptance."
  }
}
