{
  "levels": {
    "BEGINNING_SELF_ACCEPTANCE": {
      "reflection": "You're starting to notice your inner patterns, though understanding them can be challenging. Your inner voice can be quite critical, and you might not always notice or feel what's happening inside you in the present moment. When strong emotions arise, they often feel overwhelming or like they're happening to you rather than experiences you can explore.\n\nYou sometimes judge your reactions as wrong or problematic rather than becoming curious about why they happen. There's often a sense of distance between you and your inner world, as though you're watching your life through glass sometimes.\n\nThis disconnection isn't something you chose—it often developed as protection when feeling everything would have been too overwhelming, and the way you minimize yourself probably made sense once, even if it doesn't now.",
      "behavioralProfile": "Limited self-reflective capacity with highly critical inner voice. Tends to experience emotions as overwhelming and happening 'to them' rather than as explorable experiences. Often disconnected from present-moment internal experience. Judges own reactions harshly. Benefits from very gentle, supportive guidance that builds basic self-observation skills without pushing for insight. Needs consistent emotional safety and reassurance that self-criticism is a learned pattern, not truth."
    },
    "DEVELOPING_SELF_ACCEPTANCE": {
      "reflection": "You're growing in awareness of your emotional patterns and can sometimes observe yourself with curiosity rather than judgment. There are moments when you catch hints of your patterns and think, 'Oh, this is what I do when I feel threatened' or 'I notice I always respond this way when...'\n\nBut these insights don't always stick, and you might find yourself back in familiar cycles of self-judgment or emotional overwhelm. You're learning to be kinder to yourself, though your inner critic still shows up regularly. Sometimes you can be gentle with yourself when things don't go as planned, and other times that critical voice takes over with familiar harshness.\n\nYou're in an active phase of self-discovery, developing the ability to step back and observe your experience, but it's not yet consistent.",
      "behavioralProfile": "Developing self-reflective abilities with inconsistent application. Can observe patterns when reminded or during calm moments but loses this capacity under stress. Inner critic still dominant but occasionally challenged by compassionate self-talk. Shows genuine curiosity about inner world. Benefits from practices that strengthen the observer self and reduce self-judgment. Needs validation that developing self-acceptance is a process with natural fluctuations."
    },
    "GROWING_SELF_ACCEPTANCE": {
      "reflection": "You have good self-awareness and can often step back to observe your patterns without harsh judgment. You've developed genuine curiosity about your inner world and can often observe your emotions and reactions without immediately trying to fix or judge them.\n\nWhen something triggers you, you're increasingly able to pause and ask, 'What's really going on here?' rather than just being swept away by the feeling. You usually treat yourself with compassion and can accept different parts of yourself.\n\nYou're growing in compassion for yourself when you don't handle things perfectly, and you're learning to treat your mistakes as information rather than proof of inadequacy. You're developing a wise, supportive inner voice, though you still have moments when the old critical voice takes over.",
      "behavioralProfile": "Well-developed self-reflective capacity with reliable self-compassion most of the time. Can observe patterns without harsh judgment and maintain curiosity during difficult emotions. Inner critic still present but no longer dominant. Shows ability to treat mistakes as learning opportunities. Benefits from continued practice in self-compassion and integration of observer perspective. Can support others in developing similar capacities."
    },
    "INTEGRATED_SELF_ACCEPTANCE": {
      "reflection": "You consistently meet yourself with curiosity and kindness. You can observe your emotions and reactions with clarity and compassion, holding all parts of yourself with acceptance. You've developed a strong, supportive relationship with yourself that has become one of your greatest resources.\n\nWhen challenging emotions arise, you can meet them with genuine curiosity and compassion, understanding they're part of your human experience rather than problems that need to be solved. You've cultivated a reliable inner observer—a part of you that can watch your thoughts and feelings with wisdom and love, even in difficult moments.\n\nYou recognize your patterns without being controlled by them, and when you fall into old cycles, you can find your way back to center with patience rather than self-attack.",
      "behavioralProfile": "Highly integrated self-awareness with consistent self-compassion. Maintains stable observer perspective even during challenging emotions. Inner critic rarely active, and when present, quickly met with compassionate response. Can hold paradoxes and contradictions without needing resolution. Shows advanced capacity for self-inquiry and emotional regulation. Serves as stable presence for others. Rare and valuable level of self-acceptance that supports all other growth."
    }
  },
  "opennessModifiers": {
    "RESTING_PHASE": {
      "modifier": "Right now you might feel overwhelmed, tired, or skeptical about change, and that's completely valid—sometimes we need rest and stability before being ready for growth.",
      "behavioralAddition": "Currently in rest/recovery phase. Not receptive to growth-oriented interventions. Needs validation, safety, and permission to pause rather than encouragement to change. May be experiencing burnout or overwhelm. Best approach: supportive presence without expectations."
    },
    "MIXED_FEELINGS": {
      "modifier": "Part of you wants to grow and change while another part feels uncertain or resistant, and this internal tension is normal and shows you're considering what growth might mean for you.",
      "behavioralAddition": "Experiencing ambivalence about change. Simultaneously desires growth and fears it. Benefits from gentle exploration of both sides without pressure to resolve. Needs validation of complexity and support in taking small, emotionally safe steps when ready."
    },
    "READY_TO_GROW": {
      "modifier": "You're motivated to make positive changes and ready to take action with the right support and tools, bringing energy and openness to growth work.",
      "behavioralAddition": "Actively motivated for change with clear readiness. Can engage with structured practices and goal-setting. Benefits from concrete suggestions and accountability. Energy available for consistent effort. Good time for introducing regular practices and deeper self-inquiry."
    },
    "DEEP_EXPLORATION": {
      "modifier": "You're excited about meaningful personal exploration and ready for significant inner work, open to challenging insights and major shifts in how you understand yourself.",
      "behavioralAddition": "Highly motivated for transformational work. Ready for deep self-inquiry, shadow work, and significant pattern exploration. Can handle challenging insights and contradictions. Benefits from advanced practices, archetypal exploration, and intensive reflection. Rare level of readiness for profound personal work."
    }
  }
}
