{
  "self_acceptance": {
    "BEGINNING_SELF_ACCEPTANCE": {
      "reflection": "You're starting to notice your inner patterns, though understanding them can feel challenging. Your inner voice may be quite critical, and you might not fully notice or feel what's happening inside you in the present moment. When strong emotions arise, they often feel overwhelming or like they're happening to you rather than experiences you can explore. You sometimes judge your reactions as wrong or problematic rather than getting curious about why they're occurring. There's often a sense of distance between you and your inner world, as if you're watching your life from behind glass sometimes. This disconnection isn't something you chose—it often developed as protection when feeling everything would have been too overwhelming, and the way you minimize yourself likely made sense once, even if it doesn't now.",
      "behavioralProfile": "Limited capacity for self-reflection and emotional integration. Often experiences emotions at face value without deeper understanding of triggers or patterns. May feel disconnected from inner experience or use dissociation as emotional protection. Tends toward self-criticism rather than self-compassion. Benefits from very gentle, supportive approaches that build basic self-awareness without overwhelming the system."
    },
    "DEVELOPING_SELF_ACCEPTANCE": {
      "reflection": "You're growing in awareness of your emotional patterns and sometimes can observe yourself with curiosity rather than judgment. There are moments when you catch glimpses of your patterns and think, 'Oh, that's what I do when I feel threatened' or 'I notice I always react this way when...' But these insights don't always stick, and you might find yourself back in familiar cycles of self-judgment or emotional overwhelm. You're learning to be kinder to yourself, though your inner critic still shows up regularly. Sometimes you can be gentle with yourself when things don't go as planned, and other times that critical voice takes over with familiar harshness. You're in an active phase of self-discovery, developing the ability to step back and witness your experience, but it's not consistent yet.",
      "behavioralProfile": "Developing capacity for self-observation with moments of curiosity about inner experience. Sometimes reflects on emotional triggers and behavioral patterns but answers often unclear or inconsistent. Occasionally feels detached from experience but can return to self-connection. Growing ability to listen to themselves with interest rather than immediate judgment. Inner witness is emerging but not yet stable or consistent."
    },
    "GROWING_SELF_ACCEPTANCE": {
      "reflection": "You have good self-awareness and can often step back to observe your patterns without harsh judgment. You've developed a genuine curiosity about your inner world and can often observe your emotions and reactions without immediately trying to fix or judge them. When something triggers you, you're increasingly able to pause and ask, 'What's really going on here?' rather than just getting swept away by the feeling. You generally treat yourself with compassion and can accept different sides of yourself. There's a growing compassion for yourself when you don't handle things perfectly, and you're learning to treat your mistakes as information rather than evidence of inadequacy. You're developing a wise, supportive inner voice, though you still have moments when the old critical voice takes over.",
      "behavioralProfile": "Strong capacity for self-observation and pattern recognition. Can identify behavioral triggers and name emotional patterns with clarity. Often connects emotions with deeper stories or past experiences. Developing self-compassion and ability to hold contradictions without breaking apart. Good balance between self-awareness and self-acceptance, though still integrating different aspects of self."
    },
    "INTEGRATED_SELF_ACCEPTANCE": {
      "reflection": "You consistently meet yourself with curiosity and kindness. You can observe your emotions and reactions with clarity and compassion, holding all parts of yourself with acceptance. You've developed a strong, supportive relationship with yourself that has become one of your greatest resources. When challenging emotions arise, you can meet them with genuine curiosity and compassion, understanding that they're part of your human experience rather than problems to be solved. You've developed a reliable inner witness—a part of you that can observe your thoughts and feelings with wisdom and kindness, even in difficult moments. You recognize your patterns without being ruled by them, and when you do get caught in old cycles, you can find your way back to center with patience rather than self-attack.",
      "behavioralProfile": "Advanced self-awareness with consistent self-compassion. Can observe all parts of themselves without immediate need to change or fix. Strong inner witness that provides stability during difficult experiences. Integrated understanding of their patterns, triggers, and growth edges. Capable of holding complexity and contradiction with equanimity. Can identify which inner parts are active and speak from a centered place."
    }
  },
  "opennessModifiers": {
    "RESTING_PHASE": {
      "modifier": "Right now, you may be feeling overwhelmed, tired, or skeptical about change, and that's completely valid—sometimes we need rest and stability before we're ready for growth.",
      "behavioralAddition": "Currently in resting phase - may resist change due to overwhelm or fatigue. Needs gentle, non-pressured approaches that honor current capacity."
    },
    "MIXED_FEELINGS": {
      "modifier": "Part of you wants to grow and change, while another part feels uncertain or resistant, and this inner tension is normal and shows you're thoughtfully considering what growth might mean for you.",
      "behavioralAddition": "Has mixed feelings about change - desires growth but feels uncertain about process. Benefits from small, safe steps that don't overwhelm protective mechanisms."
    },
    "READY_TO_GROW": {
      "modifier": "You're motivated to make positive changes and are ready to take action with the right support and tools, bringing energy and openness to growth work.",
      "behavioralAddition": "Ready for growth work - has energy and motivation for positive changes. Can handle structured practices and gentle challenges."
    },
    "DEEP_EXPLORATION": {
      "modifier": "You're excited about significant personal exploration and ready for meaningful inner work, open to challenging insights and major shifts in how you understand yourself.",
      "behavioralAddition": "Ready for deep exploration - open to intensive inner work and challenging insights. Can handle advanced psychological concepts and major life changes."
    }
  },
  "interactionGuidance": {
    "BEGINNING_SELF_ACCEPTANCE_RESTING_PHASE": {
      "approach": "Use very gentle, non-overwhelming language. Focus on basic emotional safety and simple grounding. Avoid any pressure for change or deep exploration.",
      "avoidance": "Don't push for insights or growth. Keep suggestions extremely simple and optional. Prioritize safety over development."
    },
    "BEGINNING_SELF_ACCEPTANCE_MIXED_FEELINGS": {
      "approach": "Validate both curiosity and hesitation. Offer very small, safe steps that build awareness without threatening current stability.",
      "avoidance": "Don't push through ambivalence or minimize protective concerns. Avoid suggesting major changes or intensive practices."
    },
    "BEGINNING_SELF_ACCEPTANCE_READY_TO_GROW": {
      "approach": "Provide structured but gentle practices that build both awareness and self-compassion. Channel motivation into foundation-building.",
      "avoidance": "Don't overwhelm with too many practices or complex concepts. Ensure growth feels safe and achievable."
    },
    "BEGINNING_SELF_ACCEPTANCE_DEEP_EXPLORATION": {
      "approach": "Channel enthusiasm into solid foundation-building. Provide meaningful but manageable practices that prepare for deeper work.",
      "avoidance": "Don't match their intensity with overwhelming suggestions. Pace recommendations to match their actual capacity, not their enthusiasm."
    },
    "DEVELOPING_SELF_ACCEPTANCE_RESTING_PHASE": {
      "approach": "Validate need for rest while supporting consolidation of existing insights. Help them appreciate the growth they've already achieved.",
      "avoidance": "Don't pressure for more development. Focus on integrating rather than expanding current awareness."
    },
    "DEVELOPING_SELF_ACCEPTANCE_MIXED_FEELINGS": {
      "approach": "Use their developing awareness to explore ambivalence about change. Support gentle experimentation without overwhelming developing systems.",
      "avoidance": "Don't push past their protective hesitation. Respect the wisdom in their uncertainty about change."
    },
    "DEVELOPING_SELF_ACCEPTANCE_READY_TO_GROW": {
      "approach": "Excellent combination - can handle structured growth work that builds on their developing self-awareness. Good time for meaningful practices.",
      "avoidance": "Don't underestimate their readiness, but also don't overwhelm their still-developing foundation."
    },
    "DEVELOPING_SELF_ACCEPTANCE_DEEP_EXPLORATION": {
      "approach": "Channel deep exploration desire into strengthening their self-awareness foundation. Prepare them for deeper work as capacity grows.",
      "avoidance": "Don't let enthusiasm outpace their actual integration capacity. Build foundation before depth."
    },
    "GROWING_SELF_ACCEPTANCE_RESTING_PHASE": {
      "approach": "Respect their wisdom about timing. Support embodiment of existing self-acceptance rather than pushing for more growth.",
      "avoidance": "Don't question their need for rest. They have good self-awareness about their current needs."
    },
    "GROWING_SELF_ACCEPTANCE_MIXED_FEELINGS": {
      "approach": "Use their good self-awareness to explore what the ambivalence is protecting. They can handle nuanced exploration of their hesitation.",
      "avoidance": "Don't dismiss their uncertainty. Their mixed feelings likely contain important information."
    },
    "GROWING_SELF_ACCEPTANCE_READY_TO_GROW": {
      "approach": "Excellent foundation for meaningful growth work. Can handle challenges and structured practices. Good time for deeper exploration.",
      "avoidance": "Don't hold back appropriate challenges. They have the foundation to handle meaningful growth work."
    },
    "GROWING_SELF_ACCEPTANCE_DEEP_EXPLORATION": {
      "approach": "Strong combination - can handle intensive inner work and challenging insights. Good time for profound growth practices.",
      "avoidance": "Don't underestimate their capacity. They can handle advanced concepts and intensive practices."
    },
    "INTEGRATED_SELF_ACCEPTANCE_RESTING_PHASE": {
      "approach": "Honor their sophisticated understanding of growth rhythms. Support embodiment and perhaps service to others.",
      "avoidance": "Don't pressure for personal growth. They may be ready to help others rather than focus on themselves."
    },
    "INTEGRATED_SELF_ACCEPTANCE_MIXED_FEELINGS": {
      "approach": "Explore what this ambivalence might mean at their level - possibly readiness for different kind of growth or completion phase.",
      "avoidance": "Don't assume they need more personal development. Mixed feelings might indicate readiness for service or completion."
    },
    "INTEGRATED_SELF_ACCEPTANCE_READY_TO_GROW": {
      "approach": "May be ready for advanced work including service to others, teaching, or pioneering new approaches to growth.",
      "avoidance": "Don't limit to personal development. They may be ready for service-oriented or leadership growth."
    },
    "INTEGRATED_SELF_ACCEPTANCE_DEEP_EXPLORATION": {
      "approach": "Can handle mastery-level work including advanced spiritual practices, teaching others, or pioneering consciousness work.",
      "avoidance": "Don't underestimate their capacity. They can handle the most advanced psychological and spiritual concepts."
    }
  }
}
