{
  "love_language": {
    "QUALITY_TIME": {
      "reflections": [
        "You feel most loved when someone is fully present with you, without distractions. Shared moments restore you and remind you that you matter.",
        "Time and attention mean more than gestures — they show you are valued simply by being with someone.",
        "Closeness comes alive for you in shared experiences, and that’s when you feel most deeply seen."
      ],
      "secondaryBridge": {
        "WORDS_OF_AFFIRMATION": "You also light up when words of care are spoken — not just presence, but being named within it.",
        "ACTS_OF_SERVICE": "At the same time, actions that ease your load make shared time feel even more meaningful.",
        "PHYSICAL_TOUCH": "Closeness feels strongest when time together is paired with touch.",
        "GIFTS": "Even small gestures or surprises can add weight to the moments you share."
      }
    },
    "WORDS_OF_AFFIRMATION": {
      "reflections": [
        "Hearing warm or encouraging words gives you a deep sense of being valued. Language is more than sound — it becomes proof you matter.",
        "You carry words close, because they remind you of what you mean to others, even when you forget it yourself.",
        "Affection feels real when spoken out loud, and those words can echo in you long after they’re said."
      ],
      "secondaryBridge": {
        "QUALITY_TIME": "It matters even more when those words are spoken during moments of full presence.",
        "ACTS_OF_SERVICE": "They feel strongest when paired with actions that show the same care.",
        "PHYSICAL_TOUCH": "Hearing words alongside touch makes them land in your body, not just your mind.",
        "GIFTS": "Even small tokens can anchor the weight of words, making them last longer."
      }
    },
    "ACTS_OF_SERVICE": {
      "reflections": [
        "You feel cared for when someone lightens your load or helps in practical ways. Actions reassure you in ways words cannot.",
        "Love feels real when it shows up in what people do, not just in what they say. Small efforts become big signals of care.",
        "Being seen means someone notices what you need and steps in to help — that’s when you feel most supported."
      ],
      "secondaryBridge": {
        "QUALITY_TIME": "It means even more when that help happens while being fully present with you.",
        "WORDS_OF_AFFIRMATION": "When words of care match the actions, the reassurance runs deeper.",
        "PHYSICAL_TOUCH": "Practical care paired with touch makes the support feel both tangible and tender.",
        "GIFTS": "Even small thoughtful gestures can turn an action into a memory."
      }
    },
    "GIFTS": {
      "reflections": [
        "Little surprises or thoughtful details carry weight for you — not because of their size, but because of the meaning behind them.",
        "Objects become reminders that you’re held in mind, even when apart. They act as proof that you matter beyond the moment.",
        "A gift is more than an item — it’s a symbol of being remembered, and that symbol lingers long after it’s given."
      ],
      "secondaryBridge": {
        "QUALITY_TIME": "They mean even more when shared in a moment of full presence.",
        "WORDS_OF_AFFIRMATION": "Words given with a gift make its meaning feel deeper.",
        "ACTS_OF_SERVICE": "When paired with actions of care, a gesture becomes even more reassuring.",
        "PHYSICAL_TOUCH": "Touch alongside a gift makes the care behind it feel embodied."
      }
    },
    "PHYSICAL_TOUCH": {
      "reflections": [
        "Tenderness through touch helps you feel safe and wanted. It’s a language that speaks directly to your body and heart.",
        "Physical closeness reassures you in ways words cannot. A hand held or a hug says more than conversation ever could.",
        "Contact — whether gentle or strong — becomes the clearest proof of belonging for you."
      ],
      "secondaryBridge": {
        "QUALITY_TIME": "It feels even stronger when closeness happens during unrushed moments together.",
        "WORDS_OF_AFFIRMATION": "Hearing care spoken while being held makes the words unforgettable.",
        "ACTS_OF_SERVICE": "Actions paired with touch reassure you on both a practical and emotional level.",
        "GIFTS": "Even a small gesture means more when given hand-to-hand, with contact to carry it."
      }
    }
  }
}
