{
  "attachment": {
    "ANXIOUS": {
      "reflections": [
        "You [tone:frequency] pull closer when you sense distance, and that longing for reassurance probably grew from old fears. At the same time, you may notice it doesn't always match what's happening now — and that contrast might be protecting something deeper.",
        "Part of you [tone:frequency] seeks reassurance even when connection is steady, and that makes sense given how important closeness feels to you. Still, you might also feel the tension of wanting calm but bracing for loss.",
        "You [tone:frequency] stay alert for signs of distance, scanning for cues that love might fade. That vigilance once kept you safe, but today it can leave you carrying weight you don't always need."
      ],
      "secondaryBridge": {
        "AVOIDANT": "At the same time, another part of you values space, which can make closeness feel confusing.",
        "DISORGANIZED": "Alongside this, you sometimes swing between seeking closeness and pulling back, which adds another layer of complexity.",
        "SECURE": "Still, you also carry moments of calm and trust, which help balance the pull for reassurance."
      },
      "behavioralProfiles": {
        "STRONG": "Frequently needs reassurance and fears abandonment in relationships. Highly sensitive to partner's emotional availability and responsiveness. May engage in protest behaviors when feeling disconnected. Tends to interpret neutral behaviors as signs of rejection. Requires consistent emotional validation and clear communication about relationship security.",
        "MODERATE": "Sometimes seeks extra reassurance during stress or uncertainty. Generally trusts relationships but can become worried during periods of distance or conflict. May occasionally misinterpret partner behaviors as threatening. Benefits from regular check-ins and verbal affirmation of connection.",
        "MILD": "Occasionally needs reassurance during major relationship transitions or conflicts. Usually secure but can experience moments of doubt about partner's commitment. Generally manages uncertainty well with minimal support.",
        "VERY_MILD": "Rarely experiences significant relationship anxiety. Minimal need for extra reassurance beyond normal relationship maintenance."
      }
    },
    "AVOIDANT": {
      "reflections": [
        "You [tone:frequency] lean on independence when emotions get intense, and that distance might be guarding something tender inside you. Pulling back helps you feel safe, even when closeness could also bring comfort.",
        "Closeness can [tone:likelihood] feel overwhelming, so you create space to steady yourself. That instinct isn't wrong — it probably once protected you — but it can leave others unsure of where they stand.",
        "There's a pattern where you [tone:frequency] step away when things get heavy, and that space has meaning. It kept you safe before, but today it might also keep you from being fully seen."
      ],
      "secondaryBridge": {
        "ANXIOUS": "At the same time, another part of you longs for closeness, creating a push-pull in your relationships.",
        "DISORGANIZED": "There are moments when you both want and resist closeness, making connection unpredictable.",
        "SECURE": "But you also show signs of steadiness and trust, which sometimes soften the distance."
      },
      "behavioralProfiles": {
        "STRONG": "Strongly values independence and autonomy in relationships. Tends to withdraw emotionally when others seek closeness or during conflict. May have difficulty expressing emotions or needs directly. Often minimizes the importance of emotional connection. Requires significant personal space and time to process emotions internally before sharing.",
        "MODERATE": "Generally comfortable with independence but can engage emotionally when not feeling pressured. May pull back during intense emotional moments or conflict. Values autonomy but can maintain connection with patient partners. Benefits from indirect emotional support and respect for processing time.",
        "MILD": "Occasionally needs space during emotional intensity but generally comfortable with closeness. May have some difficulty with emotional expression but willing to work on it. Usually maintains connection while honoring need for independence.",
        "VERY_MILD": "Minimal avoidance patterns. Comfortable with both closeness and independence with little internal conflict."
      }
    },
    "DISORGANIZED": {
      "reflections": [
        "You [tone:frequency] feel pulled between wanting closeness and fearing it, and both sides are trying to protect you. That swing can feel confusing, but it carries the story of how you learned to survive connection.",
        "Part of you reaches out while another part holds back, and that inner split can be exhausting. It makes sense if trust once felt unsafe, but today it may also keep intimacy feeling unstable.",
        "Conflict can [tone:likelihood] feel overwhelming, pushing you to shut down one moment and react intensely the next. Those shifts aren't random — they're protective strategies that once kept you safe."
      ],
      "secondaryBridge": {
        "ANXIOUS": "Alongside this, your need for reassurance can amplify the swings you feel.",
        "AVOIDANT": "You also carry a need for space, which can deepen the inner conflict around closeness.",
        "SECURE": "Still, there's also some stability in you — moments where calm trust shows through."
      },
      "behavioralProfiles": {
        "STRONG": "Experiences significant internal conflict between wanting and fearing intimacy. May alternate between pursuing and rejecting closeness, sometimes within the same interaction. Relationships feel both essential and threatening. May have intense reactions to conflict that seem disproportionate. Requires very patient partners who can provide consistent security while respecting conflicted feelings about connection.",
        "MODERATE": "Sometimes feels torn between wanting closeness and needing distance. Generally can maintain relationships but may have periods of confusing or contradictory behavior around intimacy. May struggle during conflict but can recover with support. Benefits from partners who can stay calm during emotional volatility.",
        "MILD": "Occasionally experiences conflict between intimacy desires and fears, usually during stress or major life changes. Generally manages relationships well but may need extra support during difficult transitions.",
        "VERY_MILD": "Minimal disorganized patterns. Occasional moments of ambivalence about closeness but generally stable in relationships."
      }
    },
    "SECURE": {
      "reflections": [
        "You [tone:frequency] trust stability in relationships, even when things get rocky, and that steadiness is grounding. Your calmness makes it easier to ride out tension without losing connection.",
        "Even when emotions run high, you [tone:likelihood] return to a sense of safety and closeness. That flexibility helps you hold both your needs and your partner's without shutting down.",
        "You balance independence and intimacy with more ease than most, and that strength is noticeable. It gives you a foundation of trust, even when challenges arise."
      ],
      "secondaryBridge": {
        "ANXIOUS": "At times, though, you also notice worries about closeness, which don't fully disappear.",
        "AVOIDANT": "There are also moments when distance feels easier, even if connection usually wins out.",
        "DISORGANIZED": "Sometimes you still swing between pulling close and pulling away, though you recover more easily."
      },
      "behavioralProfiles": {
        "STRONG": "Comfortable with both intimacy and independence in relationships. Maintains trust and emotional stability even during conflict or stress. Communicates needs and feelings directly and listens well to others. Can provide emotional support without losing sense of self. Generally optimistic about relationships and believes in working through problems together.",
        "MODERATE": "Usually secure and trusting in relationships with occasional moments of doubt during major stress. Good communication skills and emotional regulation most of the time. Can maintain connection while respecting both partners' needs for autonomy.",
        "MILD": "Generally secure foundation with minor insecurities that surface during relationship challenges. Usually handles conflict and intimacy well but may need support during particularly difficult periods.",
        "VERY_MILD": "Minimal secure patterns alongside other more dominant attachment styles."
      }
    }
  },
  "toneModifiers": {
    "VERY_MILD": {
      "frequency": "occasionally",
      "likelihood": "at times"
    },
    "MILD": {
      "frequency": "sometimes",
      "likelihood": "can"
    },
    "MODERATE": {
      "frequency": "often",
      "likelihood": "tend to"
    },
    "STRONG": {
      "frequency": "regularly",
      "likelihood": "usually"
    }
  },
  "combinationProfiles": {
    "ANXIOUS_STRONG_AVOIDANT_MODERATE": "Experiences significant internal conflict between needing reassurance and wanting independence. May pursue connection then withdraw when it becomes available. Relationships feel both essential and threatening. Requires very patient partners who can provide consistent security while respecting need for autonomy.",
    "ANXIOUS_STRONG_AVOIDANT_STRONG": "Intense push-pull between desperate need for connection and strong drive for independence. May create chaotic relationship patterns of pursuit and withdrawal. Extremely difficult internal conflict that requires professional support and very understanding partners.",
    "ANXIOUS_STRONG_SECURE_MODERATE": "Generally trusting and communicative but with notable need for reassurance during stress. Can maintain stable relationships while occasionally needing extra validation. Strong foundation with manageable anxiety patterns.",
    "ANXIOUS_STRONG_DISORGANIZED_MODERATE": "Intense fear of abandonment combined with conflicted feelings about intimacy. May have extreme emotional reactions and difficulty regulating during relationship stress. Needs highly stable, patient partners and likely professional support.",
    "AVOIDANT_STRONG_ANXIOUS_MODERATE": "Primarily values independence but has underlying need for connection that creates internal tension. May appear distant while secretly wanting closeness. Benefits from partners who can provide security without pressure.",
    "AVOIDANT_STRONG_ANXIOUS_STRONG": "Extreme internal conflict between strong independence drive and strong connection needs. May alternate between emotional shutdown and desperate reaching for reassurance. Very challenging pattern requiring patient understanding.",
    "AVOIDANT_STRONG_SECURE_MODERATE": "Generally stable and independent with capacity for connection when not pressured. Values autonomy highly but can maintain relationships with secure partners. May appear emotionally distant but has underlying trust in relationship stability.",
    "AVOIDANT_STRONG_DISORGANIZED_MODERATE": "Strong independence needs combined with conflicted feelings about closeness. May withdraw when things feel too intimate but also struggle with complete emotional distance. Needs partners who respect complexity.",
    "SECURE_STRONG_ANXIOUS_MODERATE": "Fundamentally trusts relationships but has notable need for reassurance during stress. Generally emotionally available and communicative with periods of relationship worry. Strong foundation with manageable anxiety patterns.",
    "SECURE_STRONG_AVOIDANT_MODERATE": "Secure foundation with strong appreciation for independence. Can maintain closeness while requiring significant personal space. Generally stable with good balance between connection and autonomy.",
    "SECURE_STRONG_DISORGANIZED_MODERATE": "Generally stable and trusting but with periods of conflicted feelings about intimacy. Can usually maintain relationships despite occasional push-pull dynamics. Benefits from patient partners during confusing moments.",
    "DISORGANIZED_STRONG_ANXIOUS_MODERATE": "Intense need for connection combined with chaotic approach to relationships. May have dramatic emotional swings around intimacy. Requires extremely patient and consistent partners who can weather emotional storms.",
    "DISORGANIZED_STRONG_AVOIDANT_MODERATE": "Conflicted between wanting and fearing closeness, with tendency to create distance as protection. May sabotage relationships when they feel too good or secure. Needs partners who understand push-pull dynamics.",
    "DISORGANIZED_STRONG_SECURE_MODERATE": "Generally wants stable connection but has periods of confusing or contradictory behavior around intimacy. Can maintain relationships with patient partners who understand emotional complexity.",
    "ANXIOUS_MODERATE_AVOIDANT_STRONG": "Moderate need for reassurance complicated by strong independence drive. The avoidant patterns may dominate, creating relationships where connection is desired but consistently undermined by withdrawal.",
    "AVOIDANT_MODERATE_ANXIOUS_STRONG": "Moderate independence needs overwhelmed by strong anxiety patterns. May want space but panic when it's achieved. Creates unstable relationship dynamics requiring careful balance."
  }
}
