{
  "types": {
    "ANXIOUS": {
      "reflection": "Tu [tone:frequency] pastebi pokyčius žmonių dėmesyje ar balse, o kai kas nors atrodo tolstantis, širdis tarsi pagreitėja. Tavyje yra dalis, kuri siekia patikinimo—nori žinoti, kad vis dar esi svarbus (-i), vis dar esi laukiamas (-a).\n\nKai kyla konfliktas, tu [tone:likelihood] judini ryšį, o ne traukiesi nuo jo—tikiesi greitai pataisyti ir atkurti artumą. Pastebi smulkius niuansus, kurių kiti gali nepastebėti: trumpesnį atsakymą, išsiblaškiusį žvilgsnį, pasikeitusį šilumos toną. Šios akimirkos gali jaustis didesnės, nei yra, nes tavo sistema jautriai fiksuoja viską, kas kelia grėsmę artumui.\n\nTavo širdis trokšta saugumo, ir kai abejoji savo vieta santykyje, tu [tone:frequency] ieškai patikinimo per žodžius, laiką ar dėmesį. Tai nėra perdėtas jautrumas—tai tavo gebėjimo giliai prisirišti išraiška ir baimė prarasti tai, kas tau svarbu.",
      "secondaryBridge": {
        "AVOIDANT": "Kartu kita tavo dalis vertina nepriklausomybę ir atsitraukia, kai viskas darosi per intensyvu. Tai kuria tikrą vidinį konfliktą—gali siekti patikinimo, o tada pasijusti nepatogiai dėl to, kiek jo reikia, ir atšokti. Vieną akimirką desperatiškai trokšti artumo, o kitą—tas pats artumas ima smaugti ir norisi erdvės. Šis prieštaravimas sekina, nes tuo pat metu tenka tvarkytis ir su savimi, ir su santykio dinamika.",
        "DISORGANIZED": "Kartais svyruoji tarp artumo siekimo ir atsitraukimo taip, kad net pačiam (-iai) tai atrodo nenuspėjama. Gali veržtis į ryšį su skubumu, o tuoj pat pasijusti prislėgtas (-a) tos pačios artumos, kurios troškai. Būna akimirkų, kai nežinai, ar judėti arčiau, ar kurti distanciją—abu variantai tuo pačiu metu atrodo ir būtini, ir neįmanomi. Santykiai dėl to gali jaustis chaotiški ne todėl, kad esi „sudėtingas (-a)“, o todėl, kad skirtingos tavo dalys turi prieštaringų poreikių.",
        "SECURE": "Kartu nešiesi ir ramybės akimirkas, kurios subalansuoja tavo poreikį patikinimui. Kartais gali išbūti su neaiškumu nesukdamas (-a) į spiralę, pasitikėdamas (-a), kad laikina distancija nereiškia palikimo. Tokios ramesnės akimirkos primena: ne kiekvienas ryšio pokytis yra grėsmė. Būdamas (-a) labiau įsižeminęs (-usi), gali paprašyti to, ko reikia, be skubos, kuri kartais kitus atstumia."
      }
    },
    "AVOIDANT": {
      "reflection": "Kai emocijos įkaista ar kas nors nori priartėti, tu [tone:frequency] pajunti trauką atsitraukti ir susikurti sau kvėpavimo erdvę. Tavyje stipri nepriklausomybės ir savarankiškumo vertė—ypač tada, kai santykiai tampa intensyvūs ar daug reikalaujantys.\n\nTu [tone:likelihood] sprendi konfliktus pirmiausia pasiimdamas (-a) laiko apmąstyti, o ne neri į emocinį pokalbį. Ne todėl, kad tau nerūpi—tu tiesiog kitaip apdoroji jausmus. Kai iš tavęs daug tikimasi, suveikia tylus instinktas saugoti savastį sukuriant distanciją.\n\nGali pastebėti, kad tau patogiau klausytis nei dalintis, arba kad mieliau pirmiau susitvarkai su jausmais pats (-i), prieš įtraukiant kitą. Šis raštas tikriausiai turi šaknis, kurias verta suprasti.",
      "secondaryBridge": {
        "ANXIOUS": "Po erdvės poreikiu slypi ir dalis, kuri nerimauja prarasiantis (-i) ryšį. Gali atsitraukti, kad galėtum kvėpuoti, o netrukus sunerimti, ar ne nustūmei žmogaus per toli. Būna akimirka po atsitraukimo, kai svarstai, ar neperlenkei lazdos ir ar jis (-i) vis dar bus ten, kai būsi pasirengęs (-usi) sugrįžti. Tai kuria vidinį konfliktą—tau reikia autonomijos, kad jaustumeisi saugiai, bet ir patikinimo, kad autonomija nekainuos santykio.",
        "DISORGANIZED": "Kartais pats (-i) pasimeti svyravimuose tarp distancijos poreikio ir staigaus artumo troškimo. Gali jaustis puikiai vienumoje, o kitą akimirką desperatiškai ilgėtis ryšio. Arba siekti artumo ir tuoj pat norėti trauktis, vos kitam priartėjus per arti. Šis nenuspėjamumas apsunkina suprasti, ko iš tiesų nori—ir vienuma, ir ryšys atrodo ir būtini, ir grėsmingi tuo pat metu.",
        "SECURE": "Kartais jauti stabilumą ir pasitikėjimą, kurie daro artumą lengvesnį. Būna akimirkų, kai gali būti emociškai dalyvaujantis (-i) be įkalinimo jausmo, kai daliniesi jausmais nebijodamas (-a) būti priblokštas (-a). Tokios saugesnės būsenos primena: intymumas neprivalo reikšti savęs praradimo. Būdamas (-a) labiau įsižeminęs (-usi), gali likti ryšyje net kai sunku—užuot automatiškai rinkęsis (-usis) distanciją."
      }
    },
    "DISORGANIZED": {
      "reflection": "Artumas tau gali būti ir giliai trokštamas, ir kažkaip nesaugus tuo pačiu metu. Tu [tone:frequency] pastebi savyje svyravimus tarp ryšio siekimo ir atsitraukimo, kartais pats (-i) iki galo nesuprasdamas (-a) kodėl. Vieną akimirką gali labai norėti artumo, o kitą—tas pats artumas jaučiasi priblokščiantis ar grėsmingas.\n\nSantykiuose tu [tone:likelihood] jauti prieštaringus jausmus intymumo atžvilgiu: viena tavo dalis nori būti pamatyta ir priglausta, kita—baiminasi, kas nutiks, jei įsileisi žmogų per arti. Šis prieštaravimas painus ne tik kitiems, bet ir tau pačiam (-iai).\n\nTavo pasitikėjimo ir ryšio raštai kartais atrodo chaotiški ar labiau prieštaringi, nei norėtum. Dažnai tai siejasi su ankstyvomis patirtimis, kuriose saugumas ir artumas buvo nenuspėjami.",
      "secondaryBridge": {
        "ANXIOUS": "Be šio prieštaravimo, nešiesi ir gilią palikimo baimę, kuri viską sustiprina. Kai traukiesi, kartu baisu, kad žmogus išeis. Kai sieki artumo, neramu, jog būsi „per daug“ ir jį atstumsi. Šis derinys kuria intensyvų nerimą—negali atsipalaiduoti nei distancijoje, nei artume, nes abu variantai atrodo pavojingi. Praradimo baimė dar labiau apsunkina pasitikėti savais prieštaringais impulsais.",
        "AVOIDANT": "Kartais susidoroji atsitraukdamas, kai jaučiasi per daug pažeidžiamumo—ir tai dar labiau supainioja raštą. Gali veržtis link žmogaus su dideliu intensyvumu, o vos jam sureagavus—staiga visiškai užsidaryti. Viena tavo dalis saugo save per distanciją, o kita jaučiasi palikta dėl paties atsitraukimo. Taip gimsta skausmingas ciklas: nei priartėjimas, nei atsitraukimas neatneša palengvėjimo—abu jaučiasi kaip kažko svarbaus praradimas.",
        "SECURE": "Vis dėlto turi stabilumo akimirkų, kurios padeda grįžti į pusiausvyrą net po didesnės painiavos. Kartais gali sustoti ir atpažinti konfliktą, jam neužgožiant tavęs. Tokios labiau įsižeminusios būsenos primena, kad chaosas nėra nuolatinis—gali išbūti su prieštaringais jausmais neimdami veikti pagal kiekvieną impulsą. Pasiekęs (-usi) šią saugesnę vietą, gali pasirinkti, kaip nori reaguoti, o ne tiesiog reaguoti automatiškai."
      }
    },
    "SECURE": {
      "reflection": "Tu [tone:frequency] prieini prie santykių su ramiu pasitikėjimu, kad net ir turint nelygumų, viską galima išspręsti. Konflikto metu tu [tone:likelihood] išliekį ramus (-i) ir gebi kalbėti apie jausmus neprarasdamas (-a) vidinės pusiausvyros.\n\nTau patogu ir būti arti, ir išlaikyti savarankiškumą—gali būti giliai susijęs (-usi), kartu saugodamas (-a) savastį. Nepanikuoji, kai kitam reikia erdvės, ir nejauti grėsmės, kai žmogus nori daugiau artumo.\n\nTavo emocinės reakcijos labiau atitinka realią situaciją, o ne sustiprėja nuo senų baimių ar žaizdų. Gali aiškiai išsakyti savo poreikius ir išklausyti kitą be gynybos. Šis gebėjimas derinti nepriklausomybę ir ryšį taip pat turi šaknis, kurias verta pažinti.",
      "secondaryBridge": {
        "ANXIOUS": "Kartais vis dar išnyra nerimas dėl artumo—ypač esant didesniam stresui. Būna akimirkų, kai reikia daugiau patikinimo nei įprastai, kai kito tonas ar distancija sujudina senas baimes, nors bendrai jaustis saugiai tau įprasta. Tokios akimirkos nereiškia, kad tavo saugumas trapus—jos primena, kad visi turime pažeidžiamų vietų. Atpažinęs (-usi) šią būseną, paprastai sugrįžti į pasitikėjimą, nors nerimas kartais vis dar pasibeldžia, kai kas nors tampa neaišku.",
        "AVOIDANT": "Kartais distancija atrodo lengvesnė nei artumas, net jei dažniausiai renkiesi ryšį. Ypač per konfliktus ar stiprias emocijas gali atsirasti trauka atsitraukti—paprastai jai atsilaikai, bet vis tiek jauti. Šie vengiantys impulsai nedominuoja tavo santykių, tačiau fone kartais pastumia link erdvės, kai likti emociškai įsitraukus (-usiai) jaučiasi reikalaujantis.",
        "DISORGANIZED": "Kartais vis dar svyruoji tarp priartėjimo ir atsitraukimo, tik iš painiavos išlipi greičiau nei anksčiau. Būna akimirkų, kai neaišku, ar remtis į ryšį, ar kurti distanciją—abu variantai atrodo ir teisingi, ir klaidingi tuo pat metu. Tokios akimirkos gali sudrumsti, nes kertasi su įprastu stabilumu. Skirtumas tas, kad esi sukūręs (-usi) pakankamai saugumo, kad jaustum prieštarą ir vis tiek galėtum rinktis, kaip reaguoti."
      }
    }
  },
  "toneModifiers": {
    "VERY_MILD": {
      "frequency": "retkarčiais",
      "likelihood": "kartais"
    },
    "MILD": {
      "frequency": "kartais",
      "likelihood": "linkęs (-usi)"
    },
    "MODERATE": {
      "frequency": "dažnai",
      "likelihood": "paprastai"
    },
    "STRONG": {
      "frequency": "dažniausiai",
      "likelihood": "beveik visada"
    }
  },
  "notablePatterns": {
    "highInternalConflict": "Tavyje gyvena tikras prieštaravimas—nori artumo, bet kartu reikia distancijos. Šis vidinis konfliktas sekina, tačiau jį suprasti yra pirmas žingsnis į daugiau ramybės.",
    "defensiveShutdown": "Kai užklumpa stresas, tu linkęs (-usi) užsidaryti emociškai, kad apsisaugotum. Ne todėl, kad tau nerūpi—tu saugai save nuo perkrovos. Iššūkis—rasti kelią atgal į ryšį, kai jau gavai kvėpavimo erdvės.",
    "avoidantWithHiddenAnxiety": "Tu kuri distanciją, kad jaustumeisi saugiai, bet po ja slypi nerimas dėl ryšio. Saugai save nuo to, kas tau svarbu—todėl skauda net tada, kai atsitrauki pats (-i).",
    "reactivePursuit": "Kai jautiesi nepastebėtas (-a) ar atitolęs (-usi), tu veržiesi į ryšį su tikru skubumu. Šis intensyvumas nėra drama—tai rodo, kiek tau svarbus ryšys ir kaip skauda, kai jis atrodo grasinamas.",
    "conflictedAnxious": "Tu nori artumo, bet kartais atsitrauki būtent tada, kai jį gauni. Viena tavo dalis bijo intymumo, nors kita jo trokšta. Tai painu ir tau, ir artimiems žmonėms.",
    "strongRegulationCapacity": "Turi tikrą stiprybę išlikti emociškai stabilus (-i) net tada, kai santykiai tampa sudėtingi. Gebėjimas išlaikyti ramybę ir pusiausvyrą yra dovana—tau ir žmonėms šalia.",
    "secureLeaningAvoidant": "Vertini nepriklausomybę, bet gali likti atviras (-a) ir įsitraukęs (-usi), kai darosi sunku. Radai būdą turėti erdvės nedingstant—pusiausvyrą, kurios daugeliui trūksta.",
    "secureLeaningAnxious": "Dažniausiai pasitiki santykiais ir lieki ramus (-i). Didesnio streso metu tau prireikia daugiau patikinimo. Žinodamas (-a) tai apie save, gali paprašyti to, ko reikia, be gėdos."
  }
}
