{
  "types": {
    "ANXIOUS": {
      "reflection": "Jūs [tone:frequency] pastebite pokyčius žmonių dėmesyje ar balso tembre, ir kai kas nors atrodo tolstantis, širdis ima plakti greičiau. Jūsų dalis ieško patvirtinimo – nori žinoti, kad vis dar esate svarbus (-i), vis dar norimas (-a). Kai kyla konfliktas, jūs [tone:likelihood] judate link ryšio, o ne nuo jo, tikėdamiesi greitai pataisyti ir atkurti artumą. Pastebite mažus pokyčius, kurių kiti gali net nepastebėti: trumpesnį atsakymą, išsiblaškiusį žvilgsnį, pasikeitusį įprastą šilumos toną. Šie momentai gali atrodyti didesni, nei yra iš tikrųjų, nes jūsų sistema subtiliai nustatyta fiksuoti bet kokias artumo grėsmes. Jūsų širdis trokšta saugumo, ir kai kyla abejonių dėl savo vietos santykyje, jūs [tone:frequency] ieškote patvirtinimo per žodžius, laiką ar dėmesį. Tai nėra per jautrumas – tai išraiška jūsų gebėjimo giliai prisirišti ir baimės prarasti tai, kas jums brangu.",
      "secondaryBridge": {
        "AVOIDANT": "Kartu dalis jūsų vertina erdvę, todėl artumas kartais gali atrodyti painus.",
        "DISORGANIZED": "Kartais svyruojate tarp artumo siekimo ir atsitraukimo, o tai suteikia santykiams papildomo sudėtingumo.",
        "SECURE": "Vis dėlto nešate ir stabilumo akimirkas – pasitikėjimą, kuris padeda subalansuoti jūsų poreikį patikinimui."
      }
    },
    "AVOIDANT": {
      "reflection": "Kai emocijos stiprėja ar kas nors nori prisiartinti, jūs [tone:frequency] jaučiate poreikį atsitraukti ir susikurti šiek tiek erdvės kvėpuoti. Jūsų dalis vertina nepriklausomybę ir savarankiškumą, ypač kai santykiai tampa intensyvūs ar reikalaujantys. Jūs [tone:likelihood] sprendžiate konfliktus pasiimdami laiko apmąstyti, o ne iškart pasineriate į emocinius pokalbius. Tai ne todėl, kad jums nerūpi – tiesiog jūs apdorojate jausmus kitu tempu. Jums reikia erdvės, kad suprastumėte savo mintis ir jausmus prieš juos išsakydami. Kiti gali jūsų atsitraukimą interpretuoti kaip atstūmimą, bet jums tai būdas išlaikyti stabilumą ir išvengti emocinės perkrovos. Jūs rodote rūpestį veiksmuose – per apgalvotus, praktiškus gestus, o ne didelius emocinius išsiveržimus. Šis atstumas dažnai saugo jautresnę jūsų dalį.",
      "secondaryBridge": {
        "ANXIOUS": "Kita jūsų dalis ilgisi artumo, todėl santykyje kartais kyla traukimosi ir artėjimo dinamika.",
        "DISORGANIZED": "Yra momentų, kai vienu metu norite ir bijote artumo – tai gali paversti ryšį nenuspėjamu.",
        "SECURE": "Tačiau kartu gebate rodyti pasitikėjimą ir stabilumą, kurie sušvelnina jūsų poreikį atsitraukti."
      }
    },
    "DISORGANIZED": {
      "reflection": "Jūs [tone:frequency] atsiduriate įstrigę tarp stipraus noro būti arčiau ir baimės tuo pačiu metu. Vieną akimirką siekiate artumo, o kitą – atsitraukiate, nes nesate tikri, ką iš tiesų jaučiate. Kai kyla konfliktas, jūs [tone:likelihood] reaguojate intensyviai – kartais užsidarote, kitais kartais reaguojate stipriau, nei situacija reikalauja. Viduje vyksta kova: viena jūsų dalis trokšta saugaus ryšio, o kita įspėja, kad artumas gali būti pavojingas. Tai gali padaryti jūsų reakcijas nenuspėjamas tiek jums, tiek aplinkiniams. Kartais galite nesąmoningai išbandyti santykius – atsitraukdami, kad pamatytumėte, ar žmogus jus seka, arba stumdami, kad pamatytumėte, ar liks. Šis elgesys kyla ne iš manipuliacijos, o iš gilaus troškimo suprasti, ar esate saugus (-i) ryšyje.",
      "secondaryBridge": {
        "ANXIOUS": "Jūsų poreikis patikinimui gali sustiprinti svyravimus, kuriuos patiriate santykiuose.",
        "AVOIDANT": "Kartu nešate ir poreikį erdvei, o tai dar labiau sustiprina vidinį konfliktą dėl artumo.",
        "SECURE": "Tačiau jumyse taip pat slypi tam tikras stabilumas – ramybės ir pasitikėjimo akimirkos, kurios vis dažniau prasiveržia."
      }
    },
    "SECURE": {
      "reflection": "Jūs [tone:frequency] prieinate prie santykių su nuolatiniu pasitikėjimu, kad viskas išsispręs, net kai kyla sunkumų. Kai atsiranda konfliktas, jūs [tone:likelihood] išliekate ramus (-i) ir gebate kalbėti apie jausmus neprarasdami vidinės pusiausvyros. Jums patogu tiek būti artume, tiek išlaikyti nepriklausomybę – galite būti giliai susiję, kartu išsaugodami individualumą. Jūs nepanikuojate, kai kitam reikia erdvės, ir nejaučiate grėsmės, kai žmogus nori daugiau artumo. Jūsų emocinės reakcijos paprastai atitinka situaciją, o ne kyla iš senų baimių ar žaizdų. Gebate aiškiai išsakyti poreikius ir klausytis kitų be gynybos. Jūsų gebėjimas derinti nepriklausomybę su artumu yra brandus ir įkvepiantis – tai stabilumo forma, kuria kiti gali pasitikėti.",
      "secondaryBridge": {
        "ANXIOUS": "Kartais vis dar pastebite mažus nerimo ženklus, nors jie greitai praeina.",
        "AVOIDANT": "Būna akimirkų, kai atstumas atrodo lengvesnis, nors artumas vis tiek lieka stipresnis pasirinkimas.",
        "DISORGANIZED": "Retkarčiais vis dar svyruojate tarp artėjimo ir atsitraukimo, bet vis greičiau grįžtate į pusiausvyrą."
      }
    }
  },
  "toneModifiers": {
    "VERY_MILD": {
      "frequency": "retkarčiais",
      "likelihood": "kartais"
    },
    "MILD": {
      "frequency": "kartais",
      "likelihood": "linkęs (-usi)"
    },
    "MODERATE": {
      "frequency": "dažnai",
      "likelihood": "paprastai"
    },
    "STRONG": {
      "frequency": "dažniausiai",
      "likelihood": "beveik visada"
    }
  }
}
