{
  "love_language": {
    "WORDS_OF_AFFIRMATION": {
      "reflection": {
        "core": "Girdėti nuoširdžius, konkrečius dėkingumo, paskatinimo ir meilės žodžius pripildo tavo vidinį rezervuarą taip, kaip niekas kitas. Pastebi ir įsimeni tikslius žodžius, kuriais žmonės išreiškia rūpestį – šios frazės išlieka su tavimi dienas ar net metus, sugrįždamos kaip šilumos ir stiprybės šaltinis.",

        "subtypeA": {
          "emphasis": "Tau ypač svarbūs gilūs, prasmingi pokalbiai, kai galima tyrinėti mintis ir kalbėtis apie jausmus.",
          "behavioral": "Sužygi giliuose dialoguose ir jautiesi artimiausiai, kai kas nors nuoširdžiai įsitraukia į tavo mintis ir vidinį pasaulį per dėmesingą pokalbį."
        },

        "subtypeB": {
          "emphasis": "Tau itin reikalingi tiesioginiai meilės, dėkingumo ar paskatinimo žodžiai.",
          "behavioral": "Frazės kaip „aš tave myliu“, „tu man svarbus (-i)“ ar „matau, kiek įdėjai pastangų“ tave paliečia giliai ir visiškai pakeičia nuotaiką."
        },

        "balanced": "Vertini tiek prasmingas kalbas, tiek tiesiogines meilės išraiškas — kartais tau reikia dialogo, o kartais tiesiog išgirsti, kad esi vertinamas (-a).",

        "closing": "Kritiniai ar griežti žodžiai gali sužeisti giliau, nei kiti tikėtųsi, o nuoširdūs pagyrimai ir dėkingumo išraiškos gali akimirksniu pakeisti tavo būseną. Tikriausiai būtent todėl žodinis pripažinimas tau toks svarbus — jis primena, kad esi matomas ir mylimas toks, koks esi."
      }
    },

    "QUALITY_TIME": {
      "reflection": {
        "core": "Jautiesi labiausiai mylimas (-a) ir vertinamas (-a), kai kas nors skiria tau visą savo dėmesį. Tai ne tik buvimas tame pačiame kambaryje — svarbiausia buvimo kokybė, kai jauti, kad esi svarbiausias (-a) tą akimirką.",

        "subtypeA": {
          "emphasis": "Tau ypač svarbios bendros veiklos ir tiesioginis buvimas kartu.",
          "behavioral": "Jautiesi artimiausiai, kai kartu gaminate, vaikščiojate, dirbate ar tiesiog būnate toje pačioje erdvėje be poreikio nuolat kalbėtis."
        },

        "subtypeB": {
          "emphasis": "Tau labai reikia sutelkto, sąmoningo dėmesio – kai žmogus tikrai girdi ir domisi tavo vidiniu pasauliu.",
          "behavioral": "Kai kas nors padeda telefoną, žiūri į akis ir nuoširdžiai klausosi, tavo kūnas atsipalaiduoja, o širdis jaučiasi saugi."
        },

        "balanced": "Vertini tiek bendras veiklas, tiek sutelktus pokalbius. Kartais pakanka tylaus buvimo, kitais – atviro dėmesingo dialogo.",

        "closing": "Pertraukos ar išsiblaškymas bendro laiko metu gali žeisti labiau, nei kiti supranta, nes tau tai signalas, kad ryšys praranda prioritetą. Tau meilė — tai buvimas su žmogumi pilnai, be trukdžių."
      }
    },

    "ACTS_OF_SERVICE": {
      "reflection": {
        "core": "Jautiesi labiausiai mylimas (-a), kai kas nors pastebi tavo poreikius ir imasi veiksmų padėti, net nepaprašytas (-a). Tokie veiksmai tau reiškia daugiau nei žodžiai – jie parodo tikrą rūpestį ir dėmesingumą. Kai kas nors palengvina tavo dieną ar nuima dalį naštos, jauti, kad esi vertinamas (-a) ir ne vienas (-a).",

        "subtypeA": {
          "emphasis": "Tau ypač svarbi emocinė ir praktinė parama sunkiais momentais.",
          "behavioral": "Kai gyvenimas tampa sudėtingas, kas nors, kas įsikiša – išklauso, padeda išspręsti problemą ar tiesiog būna šalia – tau reiškia meilę."
        },

        "subtypeB": {
          "emphasis": "Tau svarbi pagalba kasdienybėje – kai kas nors perima atsakomybes ar palengvina rutiną.",
          "behavioral": "Kai žmogus tvarko reikalus, ruošia, planuoja ar padeda be prašymo, tai tave giliai paliečia – tai tylus, bet aiškus meilės ženklas."
        },

        "balanced": "Vertini tiek paramą krizių metu, tiek pagalbą kasdieniuose reikaluose. Kartais reikia, kad kas nors įsikištų, o kartais – kad tiesiog palengvintų gyvenimą.",

        "closing": "Kai pažadai lieka be veiksmų, tai skaudina, nes tau meilė matuojama ne ketinimais, o tuo, ką žmogus iš tikrųjų daro. Tikri veiksmai tau yra tikriausias rūpesčio įrodymas."
      }
    },
    "GIFTS": {
      "reflection": {
        "core": "Mažos staigmenos ar apgalvotos dovanos tau turi reikšmę ne dėl vertės, o dėl minties, slypinčios už jų. Tokie gestai primena, kad esi žmogaus mintyse net tada, kai nesate kartu. Kiekviena dovana tampa tarsi emocinis simbolis – apčiuopiamas meilės ir dėmesio ženklas, kuris išlieka net po to, kai žodžiai pamirštami.",

        "subtypeA": {
          "emphasis": "Tau ypač svarbios prasmingos, apgalvotos dovanos, kurios atspindi tikrą supratimą apie tave.",
          "behavioral": "Kai žmogus tau įteikia kažką asmeniško, kas atspindi tavo skonį ar istoriją, jauti, kad jis iš tiesų tave pažįsta ir vertina."
        },

        "subtypeB": {
          "emphasis": "Tau patinka dažni, maži rūpesčio ženklai – gestai, kurie parodo, kad esi prisimenamas (-a).",
          "behavioral": "Kai kas nors netikėtai atneša tavo mėgstamą užkandį, palieka mažą užrašą ar dovanėlę, tai priverčia nusišypsoti – nes tai primena, kad esi žmogaus mintyse."
        },

        "balanced": "Vertini tiek prasmingas, retesnes dovanas, tiek mažus kasdienius dėmesio gestus. Kartais reikšmę turi didesnis gestas, kitais – mažos, bet nuoširdžios smulkmenos.",

        "closing": "Pamirštos progos ar paviršutiniškos dovanos žeidžia ne dėl materialumo, o dėl dėmesio stokos. Tau dovana – tai būdas pasakyti: „Aš tave matau ir galvoju apie tave.“"
      }
    },

    "PHYSICAL_TOUCH": {
      "reflection": {
        "core": "Tau prisilietimas – tai kalba, kuria meilė išreiškiama tiesiai kūnui ir širdžiai. Per fizinį artumą jauti saugumą, švelnumą ir ryšį. Apkabinimas, rankos paspaudimas ar rankos laikymas perduoda tai, ko žodžiai kartais negali – tikrumą ir rūpestį.",

        "closing": "Kai jautiesi įsitempęs (-usi), neramus (-i) ar atitolęs (-usi), tau labiausiai reikia fizinio artumo – švelnaus prisilietimo, apkabinimo, buvimo šalia. Tai ne tik komfortas – tai būdas pasijusti matomu (-a), mylimu (-a) ir saugiu (-ia) žmogaus, kuris rūpi."
      }
    }
  },
  "secondaryBridges": {
    "WOA_TO_QT_A": "Tie žodžiai tampa dar gilesni, kai tariami per bendras akimirkas.",
    "WOA_TO_QT_B": "Tie žodžiai labiau paliečia, kai jie pasakyti per pilno dėmesio momentą.",
    "WOA_TO_AOS_A": "Tie žodžiai įgyja svorį, kai juos lydi pagalba ar palaikymas sunkiu metu.",
    "WOA_TO_AOS_B": "Tie žodžiai tampa tikresni, kai juos sustiprina veiksmai, palengvinantys tavo kasdienybę.",
    "WOA_TO_G_A": "Tie žodžiai tampa apčiuopiami, kai juos papildo prasminga dovana.",
    "WOA_TO_G_B": "Tie žodžiai sustiprėja per mažus, dažnus rūpesčio ženklus.",
    "WOA_TO_PT": "Tie žodžiai įgauna pilnatvę, kai juos lydi švelnus prisilietimas.",

    "QT_TO_WOA_A": "Tas buvimas tampa gilesnis, kai jį lydi prasmingas pokalbis.",
    "QT_TO_WOA_B": "Tas buvimas sustiprėja, kai jį papildo meilės žodžiai.",
    "QT_TO_AOS_A": "Tas buvimas reiškia daugiau, kai kas nors padeda ar palaiko per iššūkius.",
    "QT_TO_AOS_B": "Tas buvimas įgauna svorio, kai kartu sprendžiami kasdieniai dalykai.",
    "QT_TO_G_A": "Tas laikas kartu tampa ypatingas, kai jį pažymi prasmingos dovanos.",
    "QT_TO_G_B": "Tas buvimas įgauna šilumos per mažas, apgalvotas staigmenas.",
    "QT_TO_PT": "Tas buvimas tampa pilnas, kai jį papildo fizinis artumas.",

    "AOS_TO_WOA_A": "Ta pagalba tampa dar reikšmingesnė, kai ją lydi dėkingi žodžiai.",
    "AOS_TO_WOA_B": "Ta pagalba įgauna šilumos, kai žmogus išreiškia pripažinimą žodžiais.",
    "AOS_TO_QT_A": "Ta pagalba tampa intymesnė, kai ji atliekama kartu, per bendrą laiką.",
    "AOS_TO_QT_B": "Ta pagalba įgauna gylio, kai ją lydi pilnas dėmesys ir įsiklausymas.",
    "AOS_TO_G_A": "Tas rūpestis dera su prasmingais simboliniais gestais.",
    "AOS_TO_G_B": "Tas rūpestis gražiai papildomas mažomis staigmenomis.",
    "AOS_TO_PT": "Ta pagalba tampa pilnesnė, kai ją lydi švelnus fizinis kontaktas.",

    "G_TO_WOA_A": "Tos dovanos tampa dar reikšmingesnės, kai jas lydi nuoširdūs žodžiai.",
    "G_TO_WOA_B": "Tos dovanos įgauna svorio, kai žmogus išreiškia dėkingumą žodžiais.",
    "G_TO_QT_A": "Tos dovanos tampa ypatingos, kai įteikiamos per bendras akimirkas.",
    "G_TO_QT_B": "Tos dovanos jaučiasi šiltesnės, kai jos įteikiamos su dėmesiu ir buvimu.",
    "G_TO_AOS_A": "Tos dovanos įgyja prasmės, kai jas papildo realūs veiksmai.",
    "G_TO_AOS_B": "Tos dovanos įgauna pilnatvės, kai jas lydi rūpestingas elgesys.",
    "G_TO_PT": "Tos dovanos tampa švelnesnės, kai jas papildo fizinis artumas.",

    "PT_TO_WOA_A": "Tas prisilietimas įgauna gylio, kai jį lydi prasmingas dialogas.",
    "PT_TO_WOA_B": "Tas prisilietimas tampa dar šiltesnis, kai jį papildo meilės žodžiai.",
    "PT_TO_QT_A": "Tas fizinis artumas atrodo natūralus, kai jis dalijamasi per bendras veiklas.",
    "PT_TO_QT_B": "Tas fizinis artumas tampa intensyvesnis per pilno dėmesio akimirkas.",
    "PT_TO_AOS_A": "Tas fizinis komfortas įgauna daugiau prasmės palaikančiuose momentuose.",
    "PT_TO_AOS_B": "Tas fizinis ryšys gražiai dera su rūpestingais veiksmais.",
    "PT_TO_G_A": "Tas prisilietimas tampa dar švelnesnis, kai jį lydi mažas, prasmingas ženklas.",
    "PT_TO_G_B": "Tas prisilietimas įgauna šilumos, kai jį papildo maža, apgalvota staigmena."
  },

  "distributionPatterns": {
    "DOMINANT": {
      "userReflection": "Vienas meilės būdas tau išsiskiria aiškiai. Kai šis poreikis patenkintas, jauti pilnatvę ir ramybę. Kai ne – kitos meilės formos tiesiog neprasiskverbia taip giliai.",
      "behavioralNote": "Tavo meilės kalba turi aiškią kryptį. Svarbu, kad partneris ją atpažintų ir parodytų nuosekliai – tai tau suteikia saugumo."
    },
    "DUAL": {
      "userReflection": "Du meilės būdai tau beveik vienodai svarbūs. Tik kai abu egzistuoja kartu, jauti pilnatvę. Vienas be kito palieka tave pusiau pripildytą.",
      "behavioralNote": "Tavo širdis kalba dviem kalbomis – esi lankstus (-i), bet tau svarbu, kad abu meilės būdai būtų pastebėti ir puoselėjami."
    },
    "MULTIPLE": {
      "userReflection": "Tau meilė pasireiškia įvairiais būdais – per žodžius, buvimą, veiksmus ar simbolinius gestus. Šis lankstumas leidžia tau jaustis mylimu (-a) daugybe formų, nors kartais kitiems gali būti sunku suprasti, ko iš tikrųjų labiausiai reikia.",
      "behavioralNote": "Tu gebi priimti meilę skirtingais būdais, tačiau svarbu aiškiai išsakyti, kas tave labiausiai pripildo, kad santykiai būtų dar aiškesni ir tvirtesni."
    }
  }
}
