{
  "dimensions": {
    "mindfulness": {
      "LOW_MINDFULNESS": {
        "reflection": "Dažnai judai gyvenime autopilote, praleidžiamas signalus iš savo kūno ir emocijų, kai jie pirmą kartą iškyla. Tavo dėmesys linkęs būti išsklaidytas į kelis dalykus, todėl sunku likti dabartyje su tuo, ką išgyvenai.\n\nKai jausmai iškyla, gali juos pastebėti tik tada, kai jie jau paveikė tavo veiksmus ar nuotaiką. Tai nėra nesėkmė — tai tiesiog vieta, kur tavo dėmesys natūraliai eina, kai esi sutelkęs į kasdienes praktiškumo reikmes.\n\nSąmoningo įsisavinimo sąvoka į savo vidinį pasaulį gali atrodyti svetima ar nepraktiška, ir tas pasipriešinimas sulėtėti gali tau ką nors svarbaus pasakyti."
      },
      "MODERATE_MINDFULNESS": {
        "reflection": "Kartais pagauni save išgyvenimo viduryje ir galvoji: 'O, štai ką iš tikrųjų dabar jaučiu.' Šie pripažinimo momentai ateina ir eina — kartais esi įsitraukęs, kitais atvejais esi kur nors kitur.\n\nGali atsidurti pastebėdamas savo kvėpavimą stresinį momentą ar pagaudamas įtampą pečiuose vidury dienos. Idėja būti labiau dabartimi tau traukia, net jei nuoseklumas atrodo iššūkis.\n\nKai prisimeni sustoti ir įsijungti, dažnai atrandi išgyvenimų sluoksnius, kurie buvo visą laiką, laukdami būti pripažinti."
      },
      "GOOD_MINDFULNESS": {
        "reflection": "Išugdei tikrą santykį su dabarties momentu ir reguliariai įsijungi į tai, kas vyksta tavyje. Per savo dieną atsidurii natūraliai tikrindamas savo kvėpavimą, pastebėdamas fizinius pojūčius ar stebėdamas savo emocinę būseną, kai ji vystosi.\n\nIšmokai pagauti išgyvenimus arčiau, kai jie kyla, suteikdamas daugiau pasirinkimo, kaip atsakyti. Šis sąmoningumas nėra tobulas ar pastovus, bet jis pakankamai patikimas, kad galėtum jį pasiekti, kai labiausiai reikia.\n\nTavo gebėjimas likti dabartimi tapo vertingu ištekliu, ypač sunkių ar intensyvių momentų metu."
      },
      "HIGH_MINDFULNESS": {
        "reflection": "Dabarties momento sąmoningumas įaustas į tavo kasdienio išgyvenimo audinį. Natūraliai ilsiesi sąmoningumo apie savo kvėpavimą, kūną, mintis ir emocijas visą dieną, neturėdamas prisiminti kreipti dėmesį.\n\nKai kyla intensyvūs išgyvenimai, gali juos sutikti su erdviu, priimančiu buvimu, kuris nėra nušluojamas turinio. Tavo sąmoningumas nėra pastangų — tai tapo natūraliu būdu būti, kuris palaiko tiek tavo vidinį stabilumą, tiek gebėjimą būti visiškai dalyvaujant su kitais.\n\nŠis nuoseklus buvimas tapo viena iš tavo didžiausių stiprybių."
      }
    },
    "awareness": {
      "LOW_AWARENESS": {
        "reflection": "Kai kyla stiprūs jausmai, jie gali atrodyti pribloškiantys ar painiami, ir gali atsidurti reaguodamas prieš suprasdamas, kas iš tikrųjų vyksta tavyje. Dažnai patiri emocijas ir pojūčius kaip dalykus, kurie atsitinka tau, o ne išgyvenimus, nešančius informaciją apie tavo poreikius ar aplinkybes.\n\nGilesnė reikšmė už tavo reakcijų — kas jas sukėlė, į ką jos nurodo, ar kaip jos siejasi su tavo platesnius modelius — dažnai lieka neaiški. Tai ne apie intelektą; tai apie dar neišugdytą smalsaus savęs tyrinėjimo įprotį.\n\nTavo emocinis gyvenimas yra tikras ir validus, net kai jo žinutės jaučiasi paslaptingos."
      },
      "MODERATE_AWARENESS": {
        "reflection": "Kartais apmąstai savo jausmus ir gauni įžvalgą, ką jie reiškia, bet šis supratimas ne visada yra nuoseklus ar prieinamas momentu. Yra laikų, kai gali atsitraukti ir pagalvoti: 'O, suprantu, apie ką tai iš tikrųjų buvo,' bet kitais atvejais tavo reakcijos lieka mįslingos.\n\nVystai gebėjimą susieti savo emocijas su poreikiais, praeities išgyvenimais ar dabartinėmis aplinkybėmis, nors šis įgūdis vis dar formuojasi. Turi aiškumo momentų apie savo modelius, bet ne visada pasitiki arba veiki pagal šias įžvalgas.\n\nŠis besivystantis sąmoningumas yra vertingas — tai pagrindas gilesniam savęs supratimui."
      },
      "GOOD_AWARENESS": {
        "reflection": "Išugdei patikimą gebėjimą apmąstyti savo emocijas ir susieti jas su gilesniais poreikiais, modeliais ar aplinkybėmis. Kai kas nors tave sukelia, dažnai gali sustoti ir paklausti: 'Kas iš tikrųjų čia vyksta?' ir rasti prasmingų atsakymų.\n\nAtpažįsti savo modelius — kaip reaguoji į kritiką, kokios situacijos iškelia skirtingas tavo puses, kaip tavo praeities išgyvenimai įtakoja dabarties reakcijas. Šis savęs sąmoningumas suteikia pasirinkimų, kaip atsakyti, o ne būti varomam nesąmoningų reakcijų.\n\nNors nesuprantai visko apie save, turi tvirtus įrankius savęs tyrinėjimui ir augančiai įžvalgai."
      },
      "HIGH_AWARENESS": {
        "reflection": "Turi gilų, niuansuotą supratimą apie savo vidinį pasaulį ir gali matyti sudėtingus ryšius tarp savo emocijų, poreikių, istorijos ir dabartinių aplinkybių. Kai kyla sudėtingi jausmai, paprastai gali juos atsekti iki šaknų ir suprasti ne tik ką jauti, bet kodėl, ir ką tai reiškia platesniame tavo gyvenimo kontekste.\n\nEsi sąmoningas savo nesąmoningų modelių, augimo ribų ir subtilių būdų, kaip tavo praeitis įtakoja dabartį. Šis savęs sąmoningumo lygis leidžia sutikti save su užuojauta ir priimti sąmoningus sprendimus, kaip atsakyti į gyvenimo iššūkius.\n\nTavo vidinio kraštovaizdžio supratimas tapo galingu augimu vadovu."
      }
    }
  },
  "combinations": {
    "LOW_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Dažnai judai gyvenime autopilote, praleidžiamas signalus iš savo kūno ir emocijų. Kai kyla stiprūs jausmai, jie gali atrodyti pribloškiantys ar painiami. Santykiuose tai gali apsunkinti pastebėti partnerio poreikius ar ramiai valdyti konfliktus, bet net maži žingsniai sąmoningume sukurs daugiau ryšio.\n\nTai natūralus pradingas taškas — tavo pirmasis žingsnis tiesiog pastebėti mažus momentus, kaip savo kvėpavimą ar kūno pojūtį. Kiekviena sąmoningumo akimirka yra progresas."
    },
    "LOW_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Kartais apmąstai savo jausmus ir gauni įžvalgą, bet momentu linkęs praleisti, kas vyksta tavyje. Tai gali palikti su supratimu po fakto, bet mažiau gebėjimu atsakyti, kai tai išsivysto.\n\nSantykiuose tai gali reikšti, kad vėliau supranti, kas iš tikrųjų tau vyko, todėl praktikuojant buvimą padės dalintis atvirai ir atsakyti momentu. Paprastos sąmoningumo praktikos padės susieti savo įžvalgas su realiu laiku sąmoningumu."
    },
    "LOW_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Turi stiprų gebėjimą apmąstyti savo emocijas ir susieti jas su poreikiais ar modeliais. Tačiau gali praleisti jas, kai jos kyla momentu, o tai riboja gebėjimą veikti pagal savo įžvalgas iš karto.\n\nSantykiuose tai leidžia gerai suprasti save, bet kartais praleisti galimybes bendrauti ar prisitaikyti realiu laiku. Ugdymas dabarties momento dėmesio leis pritaikyti savo apmąstymus praktikoje, kai labiausiai svarbu."
    },
    "LOW_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Supranti save giliai ir gali matyti reikšmę už savo emocijų, bet dažnai praleidžiami jas pagaunant, kai jos vyksta. Tai reiškia, kad tavo įžvalgos gali atvykti 'per vėlai,' kad pakeistų tavo tiesioginias reakcijas.\n\nSantykiuose tai gali reikšti, kad gali paaiškinti savo poreikius vėliau, bet kovojami likti ramiu ar atsakingu karščio momentu. Sutelkimas į įsišakninimo praktikas — kaip sąmoningas kvėpavimas ar sustojimas momentu — padės sujungti tavo sąmoningumą į kasdienį gyvenimą."
    },
    "MODERATE_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Kartais pastebai savo vidinius išgyvenimus, kai jie vyksta, bet gali nesuprasti, ką jie reiškia ar kaip jie siejasi su tavo poreikiais. Tai gali palikti su sąmoningumu, bet mažai aiškumo.\n\nSantykiuose gali pastebėti įtampą kylant, bet nežinai, kaip išreikšti, ką iš tikrųjų jauti, o tai gali sukurti nesusipratimus. Apmąstymo praktikos kaip dienoraštis ar klausimai 'Į ką šis jausmas nurodo?' gali sustiprinti tavo savęs sąmoningumą."
    },
    "MODERATE_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Retkarčiais pastebai savo emocijas ir kartais apmąstai jų reikšmę, nors abi įgūdžiai vis dar vystosi. Pradedi balansuoti buvimą ir supratimą, bet tai gali jaustis nenuoseklu.\n\nSantykiuose kartais gali pagauti save ir dalintis, ką jauti, bet nuoseklumas padarys tavo komunikaciją ir empatiją stipresnę. Švelnios kasdienės praktikos — kaip trumpa sąmoninga pauzė, po kurios sekamas apmąstymas — padės stabilizuoti šį balansą."
    },
    "MODERATE_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Dažnai gerai apmąstai savo išgyvenimus, ir mokaiesi pastebėti juos momentu. Nors gali praleisti kai kuriuos signalus ar nuslysti į autopilotą, tavo pagrindas yra tvirtas.\n\nSantykiuose tai padeda dalintis savo jausmais su augančiu aiškumu, nors vis dar gali tekti sustoti prieš reaguojant sudėtingais momentais. Su nuosekliu sąmoningumo praktikavimu tavo apmąstymai taps tiesioginesni ir įgalinantys."
    },
    "MODERATE_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Giliai supranti savo emocijas ir modelius, ir kartais pagauni juos realiu laiku. Vis dėlto tavo sąmoningumas ne visada nuoseklus, todėl tavo įžvalgos gali ne visada vadovauti tavo atsakams momentu.\n\nSantykiuose tai reiškia, kad supranti, kas tave skatina, bet vis dar gali perreaguoti kartais — statybos tvirtesnė buvimo padės išreikšti poreikius ramiai. Stiprinimas kasdienių sąmoningumo įpročių padės gyventi savo gilų savęs sąmoningumą pilniau."
    },
    "GOOD_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Esi dabartimi ir gali aiškiai pastebėti emocijas ir pojūčius, bet gali kovoti interpretuoti, ką jie reiškia. Matai 'ką,' bet ne visada 'kodėl.'\n\nSantykiuose tai padeda likti ramiu ir įsišaknijusiu, nors tavo partneris gali norėti daugiau gilumo supratimo ir dalijimosi tavo vidiniu pasauliu. Apmąstymo įrankiai — kaip poreikių identifikavimas ar emocijų susiejimas su praeities išgyvenimais — praturtins tavo sąmoningumą su reikšme."
    },
    "GOOD_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Pastebai daug to, kas vyksta tavyje ir kartais susieji su gilesniais poreikiais. Nors tavo buvimas tvirtas, tavo įžvalga vis dar vystosi.\n\nSantykiuose šis balansas padeda likti dalyvaujant su kitais, nors kartais gali kovoti išreikšti pilną tavo jausmų reikšmę. Su praktika gali išplėsti gebėjimą matyti didesnį paveikslą už savo emocijų. Tai padarys tavo sąmoningą sąmoningumą dar galingesniu."
    },
    "GOOD_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Turi stiprų gebėjimą tiek pastebėti savo išgyvenimus momentu, tiek apmąstyti jų reikšmę. Šie įgūdžiai sustiprina vienas kitą, padedant sutikti iššūkius su augančiu aiškumu.\n\nSantykiuose tai padeda naršyti konfliktus konstruktyviai ir išreikšti savo emocijas būdais, kurie kviečia ryšį ir supratimą. Su tęsiamu praktikavimu pagilinsi tai į natūralų ir nuoseklų gyvenimo būdą."
    },
    "GOOD_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Gerai balansuoji buvimą ir gilią įžvalgą. Pastebai savo emocijas, kai jos kyla, ir dažnai supranti, į ką jos nurodo. Kartais iššūkiai vis dar gali išvesti iš pusiausvyros, bet turi įrankius greitai atsigauti.\n\nSantykiuose tai reiškia, kad paprastai gali aiškiai išreikšti savo poreikius ir atsakyti su rūpesčiu, net kai emocijos kyla. Stiprinimas priėmimo ir užuojautos padarys tavo sąmoningumą dar atsparesnį."
    },
    "HIGH_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Esi labai dabartimi ir sąmoningas, kas vyksta tavyje, tačiau gali ne dažnai apmąstyti gilesnę savo emocijų reikšmę. Gali aiškiai stebėti, bet gali praleisti 'žinutę' už tavo jausmų.\n\nSantykiuose šis buvimas padeda gerai klausytis ir likti ramiu, nors gali sunkiau dalintis savo gilesniais emociniais poreikiais. Praktikavimas švelnaus savęs tyrimo — kaip klausimas 'Ką ši emocija man sako?' — sujungs buvimą su įžvalga."
    },
    "HIGH_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Esi nuosekliai dabartimi savo kasdieniam gyvenime, ir kartais interpretuoji, ką tavo emocijos reiškia. Tai suteikia stabilią bazę, bet yra vietos augti susiejant išgyvenimus su tavo gilesniais poreikiais ar modeliais.\n\nSantykiuose tai padeda likti tvirtam ir dėmesingam, nors didesnis apmąstymas leis išreikšti savo vidinį pasaulį pilniau. Sujungimas sąmoningumo su apmąstymu sustiprins reikšmės kūrimo pusę tavo sąmoningumo."
    },
    "HIGH_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Gyveni su stipriu buvimu ir gera įžvalga į savo išgyvenimus. Gali pastebėti emocijas realiu laiku ir dažnai susieji jas su savo poreikiais ar modeliais. Šis balansas suteikia aiškumą ir lankstumą, kaip atsakai į iššūkius.\n\nSantykiuose šis balansas padeda aiškiai bendrauti, klausytis su empatija ir sukurti erdvę sveikiems, palaikomiems ryšiams. Tęstinas praktikavimas pagilins tavo integravimą."
    },
    "HIGH_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Išugdei integruotą sąmoningumą: esi nuosekliai dabartimi ir giliai įžvalgus. Gali pastebėti emocijas, kai jos kyla, suprasti jų reikšmę ir atsakyti su aiškumu ir užuojauta.\n\nSantykiuose tai leidžia sutikti kitus su empatija, autentiškumu ir balansu, padarant tavo ryšius giliai palaikančius ir maitinančius. Tai galinga stiprybė — tavo sąmoningumas teka natūraliai ir palaiko tavo augimą, santykius ir atsparumą."
    }
  },
  "notablePatterns": {
    "intellectualVsRealtime": "Tu gali suprasti savo emocijas ir mintis įžvalgiai - bet dažnai tik atsitraukęs, ne realiu laiku. Būti dabartyje su tuo, kas vyksta dabar, vis dar sudėtinga.",
    "observationWithoutAction": "Tu turi gebėjimą stebėti savo mintis ir jausmus be įsivėlimo. Tačiau kai emocijos stipresnės, vis dar gali reaguoti automatiškai - ta pauzė prieš reaguojant dar formuojasi.",
    "mindBodyDisconnect": "Tu gali atpažinti, ką jauti, ir suprasti, kas už to slypi. Tačiau ryšys su kūno pojūčiais - įtampa, širdies plakimu, kvėpavimu - dar ne visada aiškus.",
    "extremeLowPresence": "Didžiąją laiko dalį veiki autopilotu - mintys bėga, dienos prabėga, o vidiniai potyčiai lieka nepastebėti. Sustoti ir pajusti, kas vyksta čia ir dabar, yra retai.",
    "presenceWithoutDepth": "Tu esi labai susitelkęs į dabartį ir gali pastebėti, kas vyksta. Dar nesusiejei šių akimirkų su gilesniais modeliais - kodėl jaučiuosi taip, kaip jaučiuosi.",
    "exceptionalMindfulness": "Tu išvystei kažką reto. Tu esi dabartyje su gyvenimu, kai jis vyksta, gali stebėti savo protą neįsipainiodamas, sustabdyti prieš reaguodamas, sekti, kas vyksta tavyje, ir suprasti, kodėl jauti tai, ką jauti. Šis suvokimas tave ves.",
    "minimalMindfulness": "Tu praleidžianti didžiąją gyvenimo dalį autopilotu dabar. Dienos praeina, mintys lekia, emocijos ateina ir išeina daugiausia nepastebėtos. Tavo kūno signalai silpni, ir supratimas, kas slypi už jausmų, nėra aiškus. Tai pradžios vieta, ir suvokimas gali augti iš čia."
  }
}
