{
  "dimensions": {
    "mindfulness": {
      "LOW_MINDFULNESS": {
        "reflection": "Daug gyvenimo akimirkų praeina tarsi automatiškai – dėmesys išsisklaido tarp darbų, minčių ir pareigų, o kūno bei emocijų signalai lieka fone, kol tampa per stiprūs, kad jų nepastebėtum. Galbūt dažnai pagauni save tiesiog „veikiantį“, bet ne visada pajunti, ką iš tiesų išgyveni.\n\nKai kyla emocijos, jas dažnai pastebi tik tada, kai jos jau paveikė tavo nuotaiką ar elgesį. Tai nėra klaida ar trūkumas – tai tiesiog būdas, kuriuo tavo dėmesys įprato veikti, siekdamas tave apsaugoti nuo per didelio jautrumo ar chaoso.\n\nBūti sąmoningam šią akimirką kartais gali atrodyti neįprasta ar net nepatogu. Mintys vis ragina „daryti“, o ne „būti“. Tačiau net trumpa pauzė – keli sąmoningi įkvėpimai ar atkreiptas dėmesys į kūno pojūtį – jau keičia vidinį tempą.\n\nSąmoningumas nėra įgūdis, kurį turi arba ne. Tai raumuo, kuris stiprėja kaskart, kai atsigręži į save. Šiuo metu tau užtenka mažų, bet pastovių akimirkų, kai pasirenki sustoti ir pamatyti, kas iš tikrųjų vyksta dabar."
      },
      "MODERATE_MINDFULNESS": {
        "reflection": "Vis dažniau pagauni save būnant dabartyje – pastebi kvėpavimą, kūno įtampą ar emocijų bangą, kai ji kyla. Kartais tai įvyksta natūraliai, o kartais tik tada, kai primeni sau sulėtėti. Šie aiškumo momentai vis dar nėra pastovūs, bet jie tampa vis dažnesni.\n\nTau pažįstamas jausmas, kai trumpam pajauti vidinę tylą – kai protas sustoja ir gyvenimas atrodo aiškesnis. Vis dėlto, kasdienybės tempas dažnai tave grąžina į „režimą“, kuriame mintys lenktyniauja su laiku. Šis svyravimas tarp buvimo ir praradimo dėmesingumo – natūrali proceso dalis.\n\nKai prisimeni sustoti, atsiveria platesnis vidinis pasaulis: pojūčiai, emocijos, net subtilūs įtampos ar ramybės niuansai. Šie momentai rodo, kad sąmoningumas tau nėra svetimas – jis jau čia, tik laukia daugiau erdvės.\n\nKiekviena maža akimirka, kai pastebi, kad buvai „išėjęs“ iš dabarties, iš tiesų yra grįžimo į ją ženklas."
      },
      "GOOD_MINDFULNESS": {
        "reflection": "Tavo santykis su dabarties momentu jau gana stiprus. Dažnai pagauni save stebint kvėpavimą, kūno pojūčius ar emocinį toną – net kasdienėje veikloje. Tavo dėmesys geba persijungti iš minčių į patyrimą, suteikdamas daugiau aiškumo ir ramybės.\n\nKai kyla įtampa ar nerimas, dažnai gali pastebėti juos dar prieš tai, kai jie visiškai užvaldo. Šis atstumas tarp jausmo ir reakcijos leidžia tau pasirinkti, kaip nori atsakyti, o ne veikti automatiškai. Sąmoningumas tampa tavo stabilumo tašku – ne tik tada, kai viskas gerai, bet ir tada, kai aplinkui chaosas.\n\nVis dėlto, net ir turint šį įgūdį, vis dar gali būti momentų, kai grįžti prie senų įpročių – skubėjimo, įtampos ar vidinio kritiškumo. Tai normalu. Skirtumas tas, kad dabar tu juos pastebi. O tai reiškia, kad gali sąmoningai pasirinkti – pasilikti su tuo, ką jauti, ir leisti viskam nusėsti savaime."
      },
      "HIGH_MINDFULNESS": {
        "reflection": "Sąmoningumas tapo natūraliu tavo gyvenimo būdu. Dėmesys lengvai ilsisi ties kvėpavimu, kūnu, emocijomis ir mintimis – nereikia specialiai stengtis būti čia ir dabar. Net kasdienės akimirkos įgauna gylio: valgymas, kalbėjimas, ėjimas tampa pilnais patyrimo momentais.\n\nKai kyla stiprūs jausmai ar stresas, gebi juos sutikti su erdve, aiškumu ir priėmimu. Tu nejauti poreikio iškart keisti ar taisyti tai, kas kyla – leidiesi išbūti. Šis gebėjimas būti liudininku savo vidiniam pasauliui suteikia tau ramybės net sudėtingiausiose situacijose.\n\nTavo buvimas tampa dovanų šaltiniu ir kitiems – žmonės jaučiasi saugiau tavo akivaizdoje, nes tavo stabilumas ir ramybė yra juntami. Šis nuoseklus buvimas su savimi ir pasauliu yra ne pasiekimas, o natūrali tavo brandos išraiška."
      }
    },
    "awareness": {
      "LOW_AWARENESS": {
        "reflection": "Kai kyla stiprios emocijos, jos gali užlieti ir palikti tave sutrikusį. Reaguoji greičiau nei supranti, kas iš tikrųjų vyksta tavo viduje. Jausmai atrodo kaip kažkas, kas tiesiog nutinka – tarsi būtum keleivis, o ne vairuotojas savo vidiniame pasaulyje.\n\nDažnai pastebi emociją, bet ne iki galo supranti, iš kur ji kilo ar ką ji bando tau pasakyti. Šis atotrūkis tarp patyrimo ir jo prasmės gali kelti pasimetimą arba savikritiką. Tačiau tai nėra tavo klaida – tiesiog dar neįpratai išgirsti tylų vidinį balsą po reakcijų triukšmu.\n\nSąmoningumas čia reiškia ne analizę, o smalsumą: „Kas dabar manyje vyksta? Ko man reikia?“ Šie klausimai atveria kelią iš paviršinių emocijų į tikresnį savęs pažinimą.\n\nTavo emocinis pasaulis yra turtingas, net jei šiuo metu atrodo miglotas. Kiekviena akimirka, kai sustoji ir pastebi, ką jauti, yra mažas, bet svarbus žingsnis į didesnį aiškumą."
      },
      "MODERATE_AWARENESS": {
        "reflection": "Kartais sustoji ir gali suprasti, ką iš tikrųjų jauti ar kodėl taip sureagavai. Šie aiškumo momentai tampa vis dažnesni, tačiau vis dar nėra pastovūs. Vieną dieną gebi matyti savo vidinius procesus aiškiai, o kitą – jie vėl atrodo chaotiški.\n\nMokaisi pastebėti, kaip praeities patirtys, vertybės ar nesaugumo momentai veikia tavo dabartines reakcijas. Kartais dar sunku tuo pasitikėti arba veikti pagal įžvalgas, bet kiekvienas toks pastebėjimas jau kuria daugiau sąmoningumo.\n\nSavo emocijas pradedi suvokti kaip informaciją, o ne kaip priešą. Kai kyla pyktis, nuovargis ar liūdesys, pradedi klausti – „Ką tai nori man parodyti?“ Šis požiūris padeda priimti save plačiau, be poreikio iškart vertinti.\n\nTavo kelias dabar – ne ieškoti atsakymų, o išmokti juos atpažinti tada, kai jie pasirodo."
      },
      "GOOD_AWARENESS": {
        "reflection": "Turi aiškų ir stabilų gebėjimą suprasti savo emocijas bei jų priežastis. Dažnai pastebi, kas tave išprovokuoja, ir supranti, kodėl reaguoji vienaip ar kitaip. Šis vidinis suvokimas leidžia tau rinktis, o ne būti valdomam emocijų.\n\nKai kas nors tave sujaudina, gali sustoti, pažvelgti giliau ir pamatyti modelį. Pastebi, kaip tam tikros situacijos ar žmonės pažadina panašias reakcijas. Šis sąmoningumas suteikia tau brandos – jis leidžia išlikti ramiam net tada, kai aplinka intensyvi.\n\nNors vis dar yra sričių, kuriose jautiesi neaiškiai, tavo gebėjimas apmąstyti ir suprasti save suteikia pagrindą tolesniam augimui. Tai reiškia, kad ne tik matai save, bet ir moki būti su savimi be panikos ar kaltės."
      },
      "HIGH_AWARENESS": {
        "reflection": "Tavo savistaba gili ir brandi. Gali aiškiai matyti, kaip emocijos, poreikiai, įsitikinimai ir praeities patirtys susijungia į visumą. Kai kyla stiprus jausmas, dažnai gali jį atsekti iki šaknų – suprasti, ką jis reiškia ir ką kviečia keisti.\n\nTavo vidinis pasaulis tau pažįstamas – ne tobulas, bet sąžiningas. Matai ne tik tai, ką jauti, bet ir priežastis, kodėl taip jauti. Tai suteikia tau galimybę pasirinkti – ar nori pasiduoti senam įpročiui, ar reaguoti iš naujo suvokimo vietos.\n\nŠis savęs pažinimo lygis neatskiria tavęs nuo kitų, o priešingai – suartina, nes supratęs save, lengviau priimi ir kitus. Tavo sąmoningumas tapo tavo vidinės laisvės forma."
      }
    }
  },
  "combinations": {
    "LOW_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Daug gyvenimo akimirkų praeina nepastebėtos – mintys, emocijos, kūno pojūčiai tiesiog teka pro šalį, kol galiausiai juos pajauti per įtampą ar nuovargį. Reakcijos dažnai kyla automatiškai, o tik vėliau pastebi, kad jau esi įsitraukęs į tam tikrą emocinį ratą. Tai gali sukurti jausmą, kad gyvenimas vyksta tarsi pats, be tavo sąmoningo dalyvavimo.\n\nSantykiuose tokia būsena kartais reiškia, kad nepastebi partnerio tonų, signalų ar poreikių, kol jie tampa aiškūs per konfliktą ar nutolimą. Šis nesąmoningas tempas neleidžia laiku atpažinti, kas vyksta tavo viduje ar tarp jūsų.\n\nTačiau tai nėra klaida – tai tiesiog ta vieta, iš kurios galima pradėti. Mažos sąmoningumo akimirkos, tokios kaip keli gilesni įkvėpimai, trumpas sustojimas dienos eigoje ar dėmesio perkėlimas į kūno pojūtį, pamažu sukuria daugiau aiškumo. Kiekvienas toks sustojimas yra žingsnis link didesnio buvimo su savimi ir kitais."
    },
    "LOW_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Turi tam tikrą gebėjimą apmąstyti savo emocijas, bet dažnai tik po to, kai situacija jau praėjo. Realioje akimirkoje vidinis pasaulis vis dar lieka miglotas. Emocijas atpažįsti retrospektyviai – gali paaiškinti, ką jauti ir kodėl, tačiau tik kai audra jau nurimsta.\n\nTokiu būdu supratimas apie save vis stiprėja, bet vis dar trūksta tiesioginio ryšio su tuo, kas vyksta dabar. Tai gali pasireikšti ir santykiuose – kai jau po pokalbio supranti, kas tave suerzino ar įskaudino, tačiau tą akimirką nepavyksta to pamatyti ar išreikšti.\n\nKelias pirmyn – išmokti pastebėti šiuos jausmus anksčiau, kai jie tik pradeda kilti. Net trumpas sustojimas prieš atsakant gali padaryti didelį skirtumą. Kiekviena nauja sąmoningumo akimirka padeda sujungti tavo įžvalgas su realiu patyrimu."
    },
    "LOW_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Turi stiprų gebėjimą suprasti savo emocijas ir mintis – dažnai gali paaiškinti, kodėl reaguoji tam tikru būdu. Tačiau šis supratimas dažnai ateina po įvykio, o ne jo metu. Tavo sąmoningumas labiau veikia kaip analizė, o ne buvimas realiu laiku.\n\nTai reiškia, kad kai emocijos kyla, jos vis dar gali tave užklupti netikėtai. Santykiuose tai gali pasireikšti kaip aiškus supratimas „po to“, bet sunkumas likti atviru ir ramiu būtent tada, kai to reikia labiausiai.\n\nŠiuo metu svarbu ne dar labiau mąstyti, o daugiau pastebėti. Tavo įžvalgos jau gilios – tereikia jas perkelti į patyrimą. Kiekvieną kartą, kai sustoji ir sąmoningai pajauti kvėpavimą, emocijos tampa mažiau grėsmingos, o tavo aiškumas – gyvas, ne teorinis."
    },
    "LOW_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Tavo savistaba gili – supranti save, savo modelius, emocijų priežastis. Tačiau realiu metu šis suvokimas ne visada pasiekiamas. Kai emocijos kyla, jos gali būti tokios stiprios, kad tavo įžvalga pavėluoja.\n\nToks atsilikimas tarp jausmo ir supratimo kartais kelia nusivylimą: žinai, kodėl kažkas vyksta, bet negali to pakeisti tuo momentu. Santykiuose tai gali atrodyti kaip „žinojimas be buvimo“ – gebėjimas aiškiai apibūdinti situaciją, bet sunkumas išlikti ramiam pokalbio metu.\n\nKelias į didesnį buvimą – sujungti savo žinojimą su kūnu. Kvėpavimas, lėtesni judesiai, dėmesio perkėlimas į pojūčius padės tavo išmintį perkelti į dabartį. Tavo įžvalgos yra tarsi žemėlapis – tereikia išmokti juo vadovautis vaikščiojant, o ne tik žiūrint iš viršaus."
    },
    "MODERATE_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Pradedi pastebėti, kas vyksta tavo kūne ir emocijose, tačiau dar sunku suprasti, kodėl. Jauti įtampą, bet ne visada atpažįsti jos priežastį. Kartais pagauni emociją, bet neturi žodžių jai įvardinti.\n\nŠis etapas yra kaip pusiaukelė tarp jautimo ir suvokimo. Dėmesingumas auga, bet įžvalga dar formuojasi. Tai normalu – tavo protas dar mokosi išgirsti signalus, kuriuos kūnas ir emocijos jau siunčia.\n\nSantykiuose tai gali reikšti, kad pagauni įtampą, bet nežinai, kaip ją paaiškinti ar išreikšti. Užuot skubėjęs, pabandyk tiesiog įvardinti: „Jaučiu įtampą, bet dar nežinau, kodėl.“ Tai jau yra sąmoningumo aktas – išbūti su tuo, kas neaišku, o ne bandyti viską iškart suprasti."
    },
    "MODERATE_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Pradedi vis dažniau pastebėti savo emocijas, o kartais ir supranti jų prasmę. Šie du gebėjimai – buvimas ir įžvalga – dar nėra visiškai sinchroniški, bet jie jau bendradarbiauja. Pastebi, kad kai esi labiau dabartyje, ir supratimas ateina greičiau.\n\nSantykiuose tai gali reikšti, kad vis dažniau atpažįsti savo emocijas ir gebi jas išreikšti taip, kad kitas žmogus tave išgirstų. Kartais vis dar paslysti į įprastus gynybos būdus, bet dabar greičiau tai pastebi.\n\nŠis etapas – labai svarbus. Jis kuria pusiausvyrą tarp proto ir patyrimo, tarp analizės ir išjautimo. Su kiekviena sąmoningumo akimirka tavo vidinis pasaulis tampa aiškesnis ir artimesnis tau pačiam."
    },
    "MODERATE_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Tavo dėmesingumas jau gana stabilus, o supratimas apie savo emocijas gilėja. Gebi pastebėti, kas vyksta, ir dažnai suvoki, kodėl. Kartais vis dar paslysti į įprastą mąstymo srautą, bet dabar turi priemones sugrįžti.\n\nSantykiuose tai leidžia tau būti labiau sąmoningam pokalbių metu, girdėti kitą žmogų ir atpažinti savo reakcijas. Vis dėlto kartais, kai emocijos stiprios, buvimas tampa sudėtingesnis – protas perima kontrolę.\n\nKiekvieną kartą, kai pasirenki grįžti prie kvėpavimo ar kūno pojūčio, stiprini savo buvimo pagrindą. Tavo sąmoningumas dabar vystosi iš įgūdžio į gyvenimo būdą."
    },
    "MODERATE_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Giliai supranti savo emocijas ir jų kilmę, ir vis dažniau gebi jas pastebėti realiu metu. Kartais, kai įtampa ar stresas padidėja, šis dėmesys vis dar dingsta, bet dabar žinai, kaip jį susigrąžinti.\n\nTavo vidinis balsas tampa vis aiškesnis – pradedi atpažinti ne tik jausmus, bet ir tai, kokius poreikius jie signalizuoja. Santykiuose tai padeda išreikšti save sąžiningiau ir priimti kitą žmogų be skubėjimo ar vertinimo.\n\nŠis derinys rodo, kad sąmoningumas tau tampa ne tik praktika, bet ir natūrali būsena, į kurią gali grįžti vėl ir vėl."
    },
    "GOOD_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Esi gebantis išlikti dabartyje – aiškiai matai, kas vyksta čia ir dabar. Tačiau dar ne visada sustoji apmąstyti, ką šie momentai tau sako. Gali puikiai pastebėti emociją, bet nesusieti jos su gilesniu poreikiu ar modeliu.\n\nSantykiuose tai leidžia tau išlikti ramiam net įtemptose situacijose, bet kiti gali norėti daugiau dalijimosi tavo vidiniu pasauliu. Šis buvimo lygis yra puikus pagrindas, o šiek tiek daugiau refleksijos padės tau suvokti ne tik „ką jauti“, bet ir „kodėl“.\n\nKiekviena akimirka, kai įsiklausai į savo jausmus giliau, sukuria daugiau sąmoningumo ir autentiškumo tavo santykiuose."
    },
    "GOOD_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Esi gana sąmoningas ir gebi atpažinti, kas vyksta tavo viduje. Kartais dar pritrūksta aiškumo, ką šie jausmai bando pasakyti, bet intuicija vis dažniau tave veda teisinga kryptimi.\n\nSantykiuose tai reiškia, kad gali išlikti įsiklausęs ir reaguoti ramiai, tačiau dar mokaisi išreikšti emocijų gilumą. Tavo gebėjimas pastebėti be vertinimo – stipri pusė, kuri atveria kelią dar didesnei autentiškumui.\n\nŠis balansas tarp buvimo ir prasmės kūrimo yra tavo augimo pamatas – pakanka tik toliau jį stiprinti per pastovų dėmesingumą."
    },
    "GOOD_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Turi brandų gebėjimą tiek būti dabartyje, tiek suprasti savo emocijų prasmę. Kai kyla iššūkiai, gebi sustoti, įsiklausyti ir išreikšti save aiškiai bei pagarbiai.\n\nSantykiuose šis balansas leidžia tau bendrauti autentiškai ir jautriai. Gali girdėti kitą žmogų, net kai nuomonės išsiskiria, ir tai sukuria pasitikėjimą.\n\nŠi pusiausvyra tarp buvimo ir įžvalgos yra tavo stiprybė – ji suteikia tau gebėjimą augti per patirtį, o ne tik po jos."
    },
    "GOOD_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Esi stabilus ir įžvalgus. Gebi pastebėti emocijas, kai jos kyla, ir suprasti, ką jos signalizuoja. Kartais, kai įtampa didelė, trumpam prarandi ryšį su šiuo gebėjimu, bet jis greitai sugrįžta.\n\nSantykiuose tai padeda išlikti atviram, empatiškam ir kantriam. Kiti jaučia, kad su tavimi galima kalbėtis be baimės būti nesuprastam. Tavo sąmoningumas ir gylis sukuria erdvę saugiam ryšiui.\n\nŠis gebėjimas derinti buvimą ir įžvalgą yra viena didžiausių tavo vidinių jėgų."
    },
    "HIGH_MINDFULNESS_LOW_AWARENESS": {
      "reflection": "Tavo buvimas dabartyje stiprus – gebi išlikti dėmesingas, bet ne visada sustoji apmąstyti, ką tai reiškia. Matai, kas vyksta, tačiau ne visada pagauni gilesnį kontekstą.\n\nSantykiuose tai suteikia ramybės, tačiau kiti gali ilgėtis didesnio tavo emocinio atvirumo. Praktikuodamas švelnų savęs tyrinėjimą – pavyzdžiui, klausd(a)mas savęs „Ką ši emocija nori man pasakyti?“ – išmoksi sujungti buvimą su prasmės kūrimu.\n\nTai ne trūkumas, o potencialas – tavo gebėjimas būti čia ir dabar jau yra stiprus pagrindas augimui į dar gilesnį sąmoningumą."
    },
    "HIGH_MINDFULNESS_MODERATE_AWARENESS": {
      "reflection": "Esi nuosekliai dėmesingas, o tavo supratimas apie emocijas gilėja. Gali atpažinti jausmus jų kilimo metu, nors dar ne visada iškart matai jų prasmę.\n\nSantykiuose tai leidžia išlikti ramiam ir įsiklausančiam, tačiau daugiau refleksijos padės išreikšti vidinį pasaulį autentiškiau. Švelnus klausimas „Ką šis jausmas man sako?“ gali tapti tiltu tarp intuicijos ir įžvalgos.\n\nŠis derinys – brandus pagrindas tolesniam augimui: sąmoningumas, kuris jau nebe praktika, o gyvenimo būdas."
    },
    "HIGH_MINDFULNESS_GOOD_AWARENESS": {
      "reflection": "Esi stabiliai įsišaknijęs dabartyje ir gebi suprasti, kas vyksta tavo viduje. Emocijas atpažįsti, kai jos kyla, ir dažnai žinai, kaip į jas atsakyti be skubėjimo ar gynybos.\n\nSantykiuose šis gebėjimas padeda išlaikyti ryšį net tada, kai nuomonės išsiskiria. Gali klausytis su empatija ir kalbėti aiškiai, be įtampos.\n\nTai rodo, kad tavo sąmoningumas tapo integruotas – ne atskira praktika, o natūrali tavo būties forma."
    },
    "HIGH_MINDFULNESS_HIGH_AWARENESS": {
      "reflection": "Tavo sąmoningumas ir įžvalga susijungė į vieną visumą. Gebi matyti savo emocijas jų kilimo momentu, suprasti jų prasmę ir atsakyti iš ramybės, o ne įtampos vietos.\n\nSantykiuose tai pasireiškia autentiškumu, empatija ir lankstumu. Gali būti atviras net tada, kai pokalbis sunkus, nes tavo buvimas stabilus ir pagarbus.\n\nTai vienas aukščiausių emocinės brandos lygių – tavo sąmoningumas neatsiejamas nuo kasdienio gyvenimo, ir jis natūraliai palaiko tave bei tavo ryšius."
    }
  },
  "notablePatterns": {
    "intellectualVsRealtime": "Supranti savo emocijas ir mintis giliai bei įžvalgiai, bet dažnai tik atsitraukęs, o ne realiu metu. Išbūti dabartyje su tuo, kas vyksta dabar, vis dar iššūkis.",
    "observationWithoutAction": "Gebėjai stebėti savo mintis ir jausmus be įsitraukimo, tačiau stipresnių emocijų metu reakcijos vis dar būna automatinės. Pauzė prieš veiksmą dar tik formuojasi.",
    "mindBodyDisconnect": "Supranti, ką jauti, ir dažnai gali tai paaiškinti, bet ryšys su kūno pojūčiais – kvėpavimu, įtampa ar energijos pokyčiais – dar nėra pilnai aiškus.",
    "extremeLowPresence": "Didžiąją dienos dalį veiki autopilotu – mintys skuba, o kūno ar emocijų signalai lieka nepastebėti. Sustoti ir pajusti, kas vyksta dabar, kol kas sudėtinga.",
    "presenceWithoutDepth": "Esi dėmesingas dabarties momentui ir gebi pastebėti, kas vyksta, tačiau dar nesieji šių akimirkų su gilesnėmis priežastimis ar modeliais – „kodėl jaučiuosi taip, kaip jaučiuosi.“",
    "exceptionalMindfulness": "Pasiekei retą gebėjimą būti čia ir dabar. Gali stebėti savo mintis neįsitraukdamas, sustoti prieš reaguodamas, sekti, kas vyksta tavo viduje, ir suprasti, kodėl jauti tai, ką jauti. Šis aiškumas ir buvimas tave veda pirmyn.",
    "minimalMindfulness": "Šiuo metu didelę dalį dienų praleidi autopilotu – mintys lekia, emocijos ateina ir išeina beveik nepastebėtos. Kūno signalai silpni, o jausmų prasmė kol kas neaiški. Tai tavo pradžios taškas – nuo čia gali augti sąmoningumas."
  }
}
