{
  "levels": {
    "BEGINNING_SELF_ACCEPTANCE": {
      "reflection": "Pradedi pastebėti savo vidinius dėsningumus, nors juos suprasti dar nėra lengva. Tavo vidinis balsas dažnai būna gana kritiškas, o kartais visai nepastebi, kas vyksta viduje šią akimirką. Kai kyla stiprios emocijos, jos gali atrodyti pribloškiančios – tarsi jos nutiktų tau, o ne būtų tavo patirtis, į kurią gali įsiklausyti.\n\nKartais savo reakcijas vertini kaip neteisingas ar netinkamas, užuot paklausęs savęs, kodėl jos kyla. Gali jaustis atitolęs nuo savo vidinio pasaulio, tarsi stebėtum savo gyvenimą per stiklą.\n\nŠis atsiribojimas nėra tavo kaltė – jis dažnai atsiranda kaip apsauga, kai jausmų buvo per daug, kad galėtum juos pilnai išlaikyti. Tokiu būdu kažkada išmokai save saugoti – tai buvo prasminga tada, net jei dabar šis būdas jau trukdo būti arčiau savęs."
    },
    "DEVELOPING_SELF_ACCEPTANCE": {
      "reflection": "Vis dažniau atpažįsti savo emocinius dėsningumus ir gebi pažvelgti į save su smalsumu, o ne vien kritiškai. Būna akimirkų, kai pagauni save galvojant: „Štai taip elgiuosi, kai jaučiuosi nesaugiai“ arba „Pastebiu, kad visada taip reaguoju, kai…“.\n\nTačiau šios įžvalgos dar ne visada išlieka, ir kartais vis dar grįžti prie pažįstamų savikritikos ar pervargimo ratų. Mokaisi būti sau švelnesnis, nors vidinis balsas vis dar linkęs grįžti prie griežtumo. Kartais gebi priimti save, kai kažkas nepavyksta, o kitais atvejais tas senas tonas vėl ima viršų.\n\nEsi aktyvioje savęs pažinimo kelionės dalyje – mokaisi stebėti save iš šalies, suprasti savo reakcijas, ir nors šis procesas dar netolygus, kiekvienas sąmoningas žingsnis stiprina tavo santykį su savimi."
    },
    "GROWING_SELF_ACCEPTANCE": {
      "reflection": "Jau turi stipresnę savivoką ir dažnai gebi stebėti savo mintis bei elgesio modelius be griežto vertinimo. Tavo vidinis balsas tapo švelnesnis – ypač tada, kai nesi stipriai įsitempęs. Pastebėjęs savikritiką, vis dažniau sugebi ją pertraukti ir pakeisti labiau palaikančiu tonu.\n\nGebėjimas išbūti su sudėtingomis emocijomis tapo tavo stiprybe – gali jas išjausti, neatmesdamas ar neskubėdamas jų pakeisti. Dažniau atskiri, kas esi tu, nuo to, ką jauti: gali patirti nerimą, bet nesitapatini su juo.\n\nKai kyla sunkumų, dar pasitaiko senųjų reakcijų, tačiau dabar greičiau grįžti į pusiausvyrą. Gebėjimas priimti save tampa vis patikimesnis, nors stabilumas streso metu dar toliau stiprėja."
    },
    "INTEGRATED_SELF_ACCEPTANCE": {
      "reflection": "Esi išsiugdęs gebėjimą priimti save su aiškumu ir švelnumu. Gali stebėti savo mintis, jausmus ir reakcijas su pagarba bei smalsumu, suteikdamas vietos visoms savo dalims. Sukūrei tvirtą vidinį santykį su savimi, tapusį vienu svarbiausių vidinių resursų.\n\nSunkias emocijas pasitinki ramiai ir su supratimu, suvokdamas, kad jos yra natūrali tavo žmogiškosios patirties dalis, o ne klaida ar silpnumas. Vidinis stebėtojas leidžia matyti save iš išminties pozicijos – su šiluma net ir tada, kai iššūkiai atrodo dideli.\n\nAtpažįsti savo senus modelius jų nebekontroliuojamas, o kai vėl paslysti į senus įpročius, gebi grįžti į vidinę pusiausvyrą su kantrybe, o ne su savęs smerkimu. Šis gebėjimas būti su savimi visose būsenose rodo brandą ir vidinį stabilumą."
    }
  },
  "opennessModifiers": {
    "RESTING_PHASE": {
      "modifier": "Šiuo metu gali jaustis pavargęs, priblokštas ar skeptiškas pokyčių atžvilgiu – ir tai visiškai natūralu. Kartais pirmiausia reikia poilsio ir stabilumo, kad atsirastų vietos naujam augimui."
    },
    "MIXED_FEELINGS": {
      "modifier": "Viena tavo dalis nori keistis ir augti, kita – abejoja ar dar jaučiasi nepasiruošusi. Ši įtampa yra natūrali ir rodo, kad rimtai svarstai, ką tau reikštų tikras pokytis."
    },
    "READY_TO_GROW": {
      "modifier": "Jauti motyvaciją imtis pokyčių ir esi pasirengęs veikti. Su tinkama parama ir kryptimi gali šią energiją panaudoti konstruktyviai ir tikslingai."
    },
    "DEEP_EXPLORATION": {
      "modifier": "Esi pasirengęs gilesniam savęs tyrinėjimui ir prasmingam vidiniam darbui. Atvirai priimi įžvalgas, iššūkius ir pokyčius, kurie gali pakeisti tavo požiūrį į save ir gyvenimą."
    }
  },
  "notablePatterns": {
    "emotionalAcceptanceHarshVoice": "Gebėjai priimti savo emocijas, tačiau tavo vidinis balsas vis dar išlieka griežtas – ypač kai sunku. Šis kontrastas vertas tavo dėmesio ir švelnumo.",
    "compassionForOthersNotSelf": "Lengvai suteiki kitiems šilumos ir supratimo, tačiau sau to paties dažnai nesuteiki. Tai, ką duotum draugui, sau taikai daug rečiau.",
    "stuckInPast": "Moki priimti dabartines emocijas, bet praeities klaidos ar neišspręsti dalykai vis dar slegia. Šis svoris pamažu gali būti paleistas.",
    "extremeHarshVoice": "Tavo vidinis balsas itin kritiškas – ypač kai susiduri su sunkumais. Jis kalba taip, kaip niekada nekalbėtum su žmogumi, kurį myli.",
    "pastPeaceNotPresentKindness": "Esi susitaikęs su praeitimi – klaidos ir įvykiai tavęs nebeslegia. Tačiau tas atlaidumas dar ne visada atsispindi tavo dabartiniame bendravime su savimi.",
    "cannotSitWithEmotions": "Tau vis dar sunku leisti emocijoms tiesiog būti – be poreikio jas tuoj pat pakeisti ar paaiškinti. Išbūti su diskomfortu šiuo metu dar sudėtinga, bet įmanoma.",
    "compassionGapWithPast": "Lengvai supranti kitų klaidas, tačiau savo praeities klaidoms vis dar sunku atleisti. Su savimi elgiesi griežčiau nei su kitais.",
    "exceptionalIntegration": "Pasiekei brandų gebėjimą būti su savimi. Gali priimti savo emocijas, kalbėtis su savimi švelniai net tada, kai sunku, pažvelgti į praeitį su supratimu ir parodyti tą pačią šilumą kitiems. Šis pagrindas tave palaiko ir stiprina.",
    "pervasiveStruggle": "Šiuo metu tau sunku būti švelniam sau – emocijos atrodo pribloškiančios, vidinis balsas griežtas, praeitis slegia. Tai nėra nesėkmė. Tai pradžios taškas, iš kurio gali prasidėti pokytis."
  }
}
