{
  "levels": {
    "BEGINNING_SELF_ACCEPTANCE": {
      "reflection": "Pradedi pastebėti savo vidinius dėsningumus, nors juos suprasti dar nėra lengva. Dažnai tave lydi gana kritiškas vidinis balsas, o kartais visai nepastebi, kas vyksta tavo viduje šią akimirką. Kai kyla stiprios emocijos, jos gali atrodyti pribloškiančios — tarsi jos nutiktų tau, o ne kaip patirtys, kurias gali tyrinėti.\n\nKartais savo reakcijas vertini kaip neteisingas ar netinkamas, užuot smalsiai paklausęs, kodėl jos kyla. Gali jaustis atitrūkęs nuo savo vidinio pasaulio, lyg stebėtum savo gyvenimą per stiklą.\n\nŠis atsiribojimas nėra tavo pasirinkimas — jis dažnai susiformuoja kaip apsauga, kai pajusti viską būtų pernelyg sunku. Tai buvo tavo būdas išgyventi, turėjęs prasmę anksčiau, net jei dabar jis nebe taip padeda."
    },
    "DEVELOPING_SELF_ACCEPTANCE": {
      "reflection": "Vis labiau atpažįsti savo emocinius dėsningumus ir kartais gebi save stebėti su smalsumu, o ne tik su kritika. Būna akimirkų, kai pagauni save galvojant: „Štai taip elgiuosi, kai jaučiuosi grėsmingai“ arba „Pastebiu, kad visada taip reaguoju, kai...“\n\nTačiau šios įžvalgos dar ne visuomet išlieka, ir neretai grįžti prie įprastų savikritikos ar emocinio išsekimo ratų. Pamažu mokaisi būti sau švelnesnis, nors vidinis kritikas vis dar dažnai iškyla. Kartais gali priimti save, kai kas nors nepavyksta, o kitais atvejais tas balsas grįžta su įprastu griežtumu.\n\nEsi aktyvioje savęs pažinimo kelionėje — vystai gebėjimą atsitraukti ir stebėti savo patirtį, nors tai dar ne visada nuoseklu."
    },
    "GROWING_SELF_ACCEPTANCE": {
      "reflection": "Jau turi pakankamai savivokos ir dažnai gebi pažvelgti į savo elgesio modelius be griežto vertinimo. Esi išugdęs tikrą smalsumą savo vidiniam pasauliui ir gali stebėti emocijas bei reakcijas, nepajutęs poreikio jų iš karto taisyti ar slopinti.\n\nKai kas nors tave sujaudina, vis dažniau sustoji ir paklausi savęs: „Kas iš tikrųjų čia vyksta?“ užuot buvęs užlietas emocijų. Paprastai elgiesi su savimi užjaučiančiai ir gebi priimti skirtingas savo puses.\n\nMokaisi būti atlaidesnis sau, kai nepasiseka idealiai, ir klaidas vis dažniau matai kaip patirtį, o ne savo vertės įrodymą. Pamažu stiprėja palaikantis vidinis balsas, nors dar kartais pasirodo senasis, kritiškas tonas."
    },
    "INTEGRATED_SELF_ACCEPTANCE": {
      "reflection": "Nuosekliai priimi save su smalsumu ir švelnumu. Gali stebėti savo emocijas ir reakcijas su aiškumu bei užuojauta, suteikdamas vietos visoms savo dalims. Esi išsiugdęs tvirtą, palaikantį santykį su savimi, tapusį vienu iš didžiausių tavo vidinių resursų.\n\nSunkias emocijas pasitinki su tikru smalsumu ir atjauta, suvokdamas, kad jos yra tavo žmogiškosios patirties dalis, o ne problema, kurią reikia išspręsti. Esi užsiauginęs patikimą vidinį stebėtoją — dalį savęs, kuri geba matyti tavo mintis ir jausmus su išmintimi ir šiluma net ir sudėtingomis akimirkomis.\n\nAtpažįsti savo senus modelius jų nebekontroliuojamas, ir net patekęs į įprastus ciklus, randi kelią atgal į savo vidinę pusiausvyrą su kantrybe, o ne su savęs smerkimu."
    }
  },
  "opennessModifiers": {
    "RESTING_PHASE": {
      "modifier": "Šiuo metu gali jaustis pavargęs, priblokštas ar skeptiškas pokyčių atžvilgiu — ir tai visiškai natūralu. Kartais mums pirmiausia reikia poilsio ir stabilumo, kad vėliau galėtume judėti į priekį."
    },
    "MIXED_FEELINGS": {
      "modifier": "Viena tavo dalis trokšta augimo ir pokyčių, kita — abejoja ar priešinasi. Ši vidinė įtampa yra natūrali ir rodo, kad rimtai svarstai, ką tau galėtų reikšti augimas."
    },
    "READY_TO_GROW": {
      "modifier": "Jauti motyvaciją keistis ir esi pasirengęs imtis veiksmų. Su tinkama parama ir priemonėmis gali įnešti daug energijos ir atvirumo į savo augimo kelią."
    },
    "DEEP_EXPLORATION": {
      "modifier": "Esi pasirengęs gilesniam savęs tyrinėjimui ir nori prasmingo vidinio darbo. Atvirai priimi iššūkius, įžvalgas ir pokyčius, kurie gali keisti tavo savęs supratimą."
    }
  }
}
